iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res9[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
      uint64_t RESULT:2;
      uint64_t OVERW:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR95;

  uint8_t res10[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH0:4;
      uint64_t WSEL_CH1:4;
      uint64_t WSEL_CH2:4;
      uint64_t WSEL_CH3:4;
      uint64_t WSEL_CH4:4;
      uint64_t WSEL_CH5:4;
      uint64_t WSEL_CH6:4;
      uint64_t WSEL_CH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH8:4;
      uint64_t WSEL_CH9:4;
      uint64_t WSEL_CH10:4;
      uint64_t WSEL_CH11:4;
      uint64_t WSEL_CH12:4;
      uint64_t WSEL_CH13:4;
      uint64_t WSEL_CH14:4;
      uint64_t WSEL_CH15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH16:4;
      uint64_t WSEL_CH17:4;
      uint64_t WSEL_CH18:4;
      uint64_t WSEL_CH19:4;
      uint64_t WSEL_CH20:4;
      uint64_t WSEL_CH21:4;
      uint64_t WSEL_CH22:4;
      uint64_t WSEL_CH23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH24:4;
      uint64_t WSEL_CH25:4;
      uint64_t WSEL_CH26:4;
      uint64_t WSEL_CH27:4;
      uint64_t WSEL_CH28:4;
      uint64_t WSEL_CH29:4;
      uint64_t WSEL_CH30:4;
      uint64_t WSEL_CH31:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH32:4;
      uint64_t WSEL_CH33:4;
      uint64_t WSEL_CH34:4;
      uint64_t WSEL_CH35:4;
      uint64_t WSEL_CH36:4;
      uint64_t WSEL_CH37:4;
      uint64_t WSEL_CH38:4;
      uint64_t WSEL_CH39:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR4;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH64:4;
      uint64_t WSEL_CH65:4;
      uint64_t WSEL_CH66:4;
      uint64_t WSEL_CH67:4;
      uint64_t WSEL_CH68:4;
      uint64_t WSEL_CH69:4;
      uint64_t WSEL_CH70:4;
      uint64_t WSEL_CH71:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH72:4;
      uint64_t WSEL_CH73:4;
      uint64_t WSEL_CH74:4;
      uint64_t WSEL_CH75:4;
      uint64_t WSEL_CH76:4;
      uint64_t WSEL_CH77:4;
      uint64_t WSEL_CH78:4;
      uint64_t WSEL_CH79:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH80:4;
      uint64_t WSEL_CH81:4;
      uint64_t WSEL_CH82:4;
      uint64_t WSEL_CH83:4;
      uint64_t WSEL_CH84:4;
      uint64_t WSEL_CH85:4;
      uint64_t WSEL_CH86:4;
      uint64_t WSEL_CH87:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSEL_CH88:4;
      uint64_t WSEL_CH89:4;
      uint64_t WSEL_CH90:4;
      uint64_t WSEL_CH91:4;
      uint64_t WSEL_CH92:4;
      uint64_t WSEL_CH93:4;
      uint64_t WSEL_CH94:4;
      uint64_t WSEL_CH95:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSELR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEN0:1;
      uint64_t CWEN1:1;
      uint64_t CWEN2:1;
      uint64_t CWEN3:1;
      uint64_t CWEN4:1;
      uint64_t CWEN5:1;
      uint64_t CWEN6:1;
      uint64_t CWEN7:1;
      uint64_t CWEN8:1;
      uint64_t CWEN9:1;
      uint64_t CWEN10:1;
      uint64_t CWEN11:1;
      uint64_t CWEN12:1;
      uint64_t CWEN13:1;
      uint64_t CWEN14:1;
      uint64_t CWEN15:1;
      uint64_t CWEN16:1;
      uint64_t CWEN17:1;
      uint64_t CWEN18:1;
      uint64_t CWEN19:1;
      uint64_t CWEN20:1;
      uint64_t CWEN21:1;
      uint64_t CWEN22:1;
      uint64_t CWEN23:1;
      uint64_t CWEN24:1;
      uint64_t CWEN25:1;
      uint64_t CWEN26:1;
      uint64_t CWEN27:1;
      uint64_t CWEN28:1;
      uint64_t CWEN29:1;
      uint64_t CWEN30:1;
      uint64_t CWEN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWENR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEN32:1;
      uint64_t CWEN33:1;
      uint64_t CWEN34:1;
      uint64_t CWEN35:1;
      uint64_t CWEN36:1;
      uint64_t CWEN37:1;
      uint64_t CWEN38:1;
      uint64_t CWEN39:1;
      uint64_t CWEN40:1;
      uint64_t CWEN41:1;
      uint64_t CWEN42:1;
      uint64_t CWEN43:1;
      uint64_t CWEN44:1;
      uint64_t CWEN45:1;
      uint64_t CWEN46:1;
      uint64_t CWEN47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWEN64:1;
      uint64_t CWEN65:1;
      uint64_t CWEN66:1;
      uint64_t CWEN67:1;
      uint64_t CWEN68:1;
      uint64_t CWEN69:1;
      uint64_t CWEN70:1;
      uint64_t CWEN71:1;
      uint64_t CWEN72:1;
      uint64_t CWEN73:1;
      uint64_t CWEN74:1;
      uint64_t CWEN75:1;
      uint64_t CWEN76:1;
      uint64_t CWEN77:1;
      uint64_t CWEN78:1;
      uint64_t CWEN79:1;
      uint64_t CWEN80:1;
      uint64_t CWEN81:1;
      uint64_t CWEN82:1;
      uint64_t CWEN83:1;
      uint64_t CWEN84:1;
      uint64_t CWEN85:1;
      uint64_t CWEN86:1;
      uint64_t CWEN87:1;
      uint64_t CWEN88:1;
      uint64_t CWEN89:1;
      uint64_t CWEN90:1;
      uint64_t CWEN91:1;
      uint64_t CWEN92:1;
      uint64_t CWEN93:1;
      uint64_t CWEN94:1;
      uint64_t CWEN95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWENR2;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH0:1;
      uint64_t AWOR_CH1:1;
      uint64_t AWOR_CH2:1;
      uint64_t AWOR_CH3:1;
      uint64_t AWOR_CH4:1;
      uint64_t AWOR_CH5:1;
      uint64_t AWOR_CH6:1;
      uint64_t AWOR_CH7:1;
      uint64_t AWOR_CH8:1;
      uint64_t AWOR_CH9:1;
      uint64_t AWOR_CH10:1;
      uint64_t AWOR_CH11:1;
      uint64_t AWOR_CH12:1;
      uint64_t AWOR_CH13:1;
      uint64_t AWOR_CH14:1;
      uint64_t AWOR_CH15:1;
      uint64_t AWOR_CH16:1;
      uint64_t AWOR_CH17:1;
      uint64_t AWOR_CH18:1;
      uint64_t AWOR_CH19:1;
      uint64_t AWOR_CH20:1;
      uint64_t AWOR_CH21:1;
      uint64_t AWOR_CH22:1;
      uint64_t AWOR_CH23:1;
      uint64_t AWOR_CH24:1;
      uint64_t AWOR_CH25:1;
      uint64_t AWOR_CH26:1;
      uint64_t AWOR_CH27:1;
      uint64_t AWOR_CH28:1;
      uint64_t AWOR_CH29:1;
      uint64_t AWOR_CH30:1;
      uint64_t AWOR_CH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWORR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH32:1;
      uint64_t AWOR_CH33:1;
      uint64_t AWOR_CH34:1;
      uint64_t AWOR_CH35:1;
      uint64_t AWOR_CH36:1;
      uint64_t AWOR_CH37:1;
      uint64_t AWOR_CH38:1;
      uint64_t AWOR_CH39:1;
      uint64_t AWOR_CH40:1;
      uint64_t AWOR_CH41:1;
      uint64_t AWOR_CH42:1;
      uint64_t AWOR_CH43:1;
      uint64_t AWOR_CH44:1;
      uint64_t AWOR_CH45:1;
      uint64_t AWOR_CH46:1;
      uint64_t AWOR_CH47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWORR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWOR_CH64:1;
      uint64_t AWOR_CH65:1;
      uint64_t AWOR_CH66:1;
      uint64_t AWOR_CH67:1;
      uint64_t AWOR_CH68:1;
      uint64_t AWOR_CH69:1;
      uint64_t AWOR_CH70:1;
      uint64_t AWOR_CH71:1;
      uint64_t AWOR_CH72:1;
      uint64_t AWOR_CH73:1;
      uint64_t AWOR_CH74:1;
      uint64_t AWOR_CH75:1;
      uint64_t AWOR_CH76:1;
      uint64_t AWOR_CH77:1;
      uint64_t AWOR_CH78:1;
      uint64_t AWOR_CH79:1;
      uint64_t AWOR_CH80:1;
      uint64_t AWOR_CH81:1;
      uint64_t AWOR_CH82:1;
      uint64_t AWOR_CH83:1;
      uint64_t AWOR_CH84:1;
      uint64_t AWOR_CH85:1;
      uint64_t AWOR_CH86:1;
      uint64_t AWOR_CH87:1;
      uint64_t AWOR_CH88:1;
      uint64_t AWOR_CH89:1;
      uint64_t AWOR_CH90:1;
      uint64_t AWOR_CH91:1;
      uint64_t AWOR_CH92:1;
      uint64_t AWOR_CH93:1;
      uint64_t AWOR_CH94:1;
      uint64_t AWOR_CH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWORR2;

  uint8_t res13[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t INPSAMP_S:8;
      uint64_t reservedSpace1:8;
      uint64_t INPSAMP_C:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMA_S:1;
      uint64_t reservedSpace0:1;
      uint64_t FMA_C:1;
      uint64_t FMA_WDTERR:1;
      uint64_t FMA_WDSERR:1;
      uint64_t reservedSpace1:2;
      uint64_t EN:1;
      uint64_t reservedSpace2:4;
      uint64_t MSKERR_S1:1;
      uint64_t MSKERR_S2:1;
      uint64_t reservedSpace3:1;
      uint64_t MSKERR_C:1;
      uint64_t MSKWDG_EOA_S:1;
      uint64_t reservedSpace4:1;
      uint64_t MSKWDG_EOA_C:1;
      uint64_t reservedSpace5:4;
      uint64_t MSKST_EOC:1;
      uint64_t reservedSpace6:1;
      uint64_t MSKWDTERR:1;
      uint64_t SERR:1;
      uint64_t MSKWDSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTEP:5;
      uint64_t reservedSpace0:3;
      uint64_t ALG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:8;
      uint64_t reservedSpace0:8;
      uint64_t WDT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t STEP_C:5;
      uint64_t reservedSpace1:2;
      uint64_t ERR_S1:1;
      uint64_t ERR_S2:1;
      uint64_t reservedSpace2:1;
      uint64_t ERR_C:1;
      uint64_t WDG_EOA_S:1;
      uint64_t reservedSpace3:1;
      uint64_t WDG_EOA_C:1;
      uint64_t reservedSpace4:4;
      uint64_t ST_EOC:1;
      uint64_t OVERWR:1;
      uint64_t WDTERR:1;
      uint64_t reservedSpace5:1;
      uint64_t WDSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:12;
      uint64_t reservedSpace0:4;
      uint64_t DATA1:12;
      uint64_t reservedSpace1:3;
      uint64_t OVFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DATA1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DATA1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR4;

  uint8_t res14[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCDATA:12;
      uint64_t reservedSpace0:6;
      uint64_t OWERWR:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:12;
      uint64_t reservedSpace0:6;
      uint64_t OWERWR:1;
      uint64_t VALID:1;
      uint64_t FDATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STDR2;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
      uint64_t reservedSpace1:2;
      uint64_t WDTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
      uint64_t reservedSpace1:3;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW1AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW1BR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:19;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW2R;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
      uint64_t reservedSpace1:2;
      uint64_t WDTE:1;
      uint64_t AWDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAW5R;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t TEST_FAIL:1;
      uint64_t AVG_EN:1;
      uint64_t NR_SMPL:2;
      uint64_t reservedSpace1:8;
      uint64_t C_T_BUSY:1;
      uint64_t reservedSpace2:11;
      uint64_t TSAMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALBISTREG;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET_USER:8;
      uint64_t reservedSpace0:8;
      uint64_t GAIN_USER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFSGNUSR;

