iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define BCTU_0 (*(volatile struct BCTU_0_tag *) 0xffc10000)

struct C55FMC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t ESUS:1;
      uint64_t ERS:1;
      uint64_t PSUS:1;
      uint64_t PGM:1;
      uint64_t reservedSpace0:3;
      uint64_t PECIE:1;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PEAS:1;
      uint64_t reservedSpace1:1;
      uint64_t SBC:1;
      uint64_t RWE:1;
      uint64_t EER:1;
      uint64_t reservedSpace2:12;
      uint64_t EEE:1;
      uint64_t AEE:1;
      uint64_t RRE:1;
      uint64_t RVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t n16Kl:3;
      uint64_t n32Kl:2;
      uint64_t n64Kl:3;
      uint64_t n16Km:3;
      uint64_t n32Km:2;
      uint64_t n64Km:3;
      uint64_t n16Kh:3;
      uint64_t n32Kh:2;
      uint64_t n64Kh:3;
      uint64_t n256K:5;
      uint64_t reservedSpace0:2;
      uint64_t HT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRE;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t reservedSpace0:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KLOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDSEL:16;
      uint64_t LOWSEL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHSEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KSEL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KSEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL3;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDR:21;
      uint64_t a16k:1;
      uint64_t a32k:1;
      uint64_t a64k:1;
      uint64_t a256k:1;
      uint64_t aL:1;
      uint64_t aM:1;
      uint64_t aH:1;
      uint64_t SAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t reservedSpace0:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t AISUS:1;
      uint64_t reservedSpace1:1;
      uint64_t AIBPE:1;
      uint64_t NAIBP:1;
      uint64_t reservedSpace2:6;
      uint64_t CPE:1;
      uint64_t CPA:1;
      uint64_t CPR:1;
      uint64_t reservedSpace3:11;
      uint64_t SBCE:1;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDOPP:16;
      uint64_t LOWOPP:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHOPP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KOPP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t A256KOPP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMD;

};

#define C55FMC_0 (*(volatile struct C55FMC_0_tag *) 0xfffe0000)

struct CAN_CAN_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXMB:7;
      uint64_t reservedSpace0:1;
      uint64_t IDAM:2;
      uint64_t reservedSpace1:2;
      uint64_t AEN:1;
      uint64_t LPRIOEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t IRMQ:1;
      uint64_t SRXDIS:1;
      uint64_t reservedSpace3:2;
      uint64_t LPMACK:1;
      uint64_t WRNEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SUPV:1;
      uint64_t FRZACK:1;
      uint64_t SOFTRST:1;
      uint64_t reservedSpace5:1;
      uint64_t NOTRDY:1;
      uint64_t HALT:1;
      uint64_t RFEN:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROPSEG:3;
      uint64_t LOM:1;
      uint64_t LBUF:1;
      uint64_t TSYN:1;
      uint64_t BOFFREC:1;
      uint64_t SMP:1;
      uint64_t reservedSpace0:2;
      uint64_t RWRNMSK:1;
      uint64_t TWRNMSK:1;
      uint64_t LPB:1;
      uint64_t reservedSpace1:1;
      uint64_t ERRMSK:1;
      uint64_t BOFFMSK:1;
      uint64_t PSEG2:3;
      uint64_t PSEG1:3;
      uint64_t RJW:2;
      uint64_t PRESDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

