iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_5 (*(volatile struct CMU_CMU_5_tag *) 0xfbfb0200)

struct CMU_CMU_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_6 (*(volatile struct CMU_CMU_6_tag *) 0xfbfb02c0)

struct CMU_CMU_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_7 (*(volatile struct CMU_CMU_7_tag *) 0xfbfb0500)

struct CMU_CMU_8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_8 (*(volatile struct CMU_CMU_8_tag *) 0xfbfb0340)

struct CMU_CMU_9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_9 (*(volatile struct CMU_CMU_9_tag *) 0xfbfb0380)

struct CMU_CMU_10_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL1:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDR;

};

#define CMU_CMU_10 (*(volatile struct CMU_CMU_10_tag *) 0xfbfb0240)

struct CRC_CRC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t SWAP:1;
      uint64_t POLYG:2;
      uint64_t SWAP_BITWISE:1;
      uint64_t SWAP_BYTEWISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUTP;

