iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
struct eTPU_eTPU_GCR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CISn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CISR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CISn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CISR_ENG2;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTRSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDTRSR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTRSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDTRSR_ENG2;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIOSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIOSR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIOSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIOSR_ENG2;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTROSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDTROSR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTROSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDTROSR_ENG2;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIEn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIEn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER_ENG2;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTREn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDTRER_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTREn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDTRER_ENG2;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDSR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDSR_ENG2;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSSR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSSR_ENG2;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSSR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSn:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSSR_ENG2;

};

#define eTPU_eTPU_GCR_0 (*(volatile struct eTPU_eTPU_GCR_0_tag *) 0xffcc0400)

struct eTPU_eTPU_LMR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG15;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLAT:16;
      uint64_t MONCHAN:5;
      uint64_t reservedSpace0:3;
      uint64_t SRSEL:3;
      uint64_t reservedSpace1:3;
      uint64_t LMM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMCR_ENG25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:1;
      uint64_t LATENCY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMMR_ENG25;

