iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define eTPU_eTPU_LMR_0 (*(volatile struct eTPU_eTPU_LMR_0_tag *) 0xffcc0100)

struct eTPU_eTPU_MESR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEDD:1;
      uint64_t CRDIS:1;
      uint64_t CTEND:1;
      uint64_t reservedSpace0:4;
      uint64_t CEIE:1;
      uint64_t DEDD:1;
      uint64_t DRDIS:1;
      uint64_t DTEND:1;
      uint64_t reservedSpace1:3;
      uint64_t MDEIE:1;
      uint64_t HDEIE:1;
      uint64_t MECIE:1;
      uint64_t reservedSpace2:14;
      uint64_t FME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INJ_ADDR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEIAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFLIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEIDPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFLIP_4_0:5;
      uint64_t reservedSpace0:3;
      uint64_t PFLIP_9_5:5;
      uint64_t reservedSpace1:3;
      uint64_t PFLIP_14_10:5;
      uint64_t reservedSpace2:3;
      uint64_t PFLIP_19_15:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEIPPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ERR_ADDR:12;
      uint64_t reservedSpace1:10;
      uint64_t ERR_CHANNEL:5;
      uint64_t reservedSpace2:1;
      uint64_t ERR_ACC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYND0:5;
      uint64_t reservedSpace0:2;
      uint64_t BE0:1;
      uint64_t SYND1:5;
      uint64_t reservedSpace1:2;
      uint64_t BE1:1;
      uint64_t SYND2:5;
      uint64_t reservedSpace2:2;
      uint64_t BE2:1;
      uint64_t SYND3:5;
      uint64_t reservedSpace3:2;
      uint64_t BE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNCOVR:1;
      uint64_t reservedSpace0:6;
      uint64_t CNCERR:1;
      uint64_t DNCOVR:1;
      uint64_t reservedSpace1:6;
      uint64_t DNCERR:1;
      uint64_t CCOVR:1;
      uint64_t reservedSpace2:6;
      uint64_t CCERR:1;
      uint64_t DCOVR:1;
      uint64_t reservedSpace3:6;
      uint64_t DCERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INJ_ADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEIAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFLIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEIDPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFLIP:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEIPPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ERR_ADDR:14;
      uint64_t reservedSpace1:8;
      uint64_t ERR_CHANNEL:5;
      uint64_t reservedSpace2:1;
      uint64_t ERR_ACC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CERAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CODE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CERDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYND:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CERSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CFIX_ADDR:14;
      uint64_t reservedSpace1:14;
      uint64_t CFIXM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEFR;

};

#define eTPU_eTPU_MESR_0 (*(volatile struct eTPU_eTPU_MESR_0_tag *) 0xffcc0200)

struct eTPU_eTPU_SCR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GTBE:1;
      uint64_t reservedSpace0:5;
      uint64_t VIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SCMERR:1;
      uint64_t SCMMISEN:1;
      uint64_t SCMMISF:1;
      uint64_t SCMMISC:1;
      uint64_t reservedSpace2:2;
      uint64_t LTO2:1;
      uint64_t LTO1:1;
      uint64_t SCMSIZE:5;
      uint64_t reservedSpace3:3;
      uint64_t ILF2:1;
      uint64_t ILF1:1;
      uint64_t MGE2:1;
      uint64_t MGE1:1;
      uint64_t WDTO2:1;
      uint64_t WDTO1:1;
      uint64_t SDMERR:1;
      uint64_t GEC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARM1:7;
      uint64_t WR:1;
      uint64_t PARM0:7;
      uint64_t PWIDTH:1;
      uint64_t PBBASE:10;
      uint64_t CTBASE:5;
      uint64_t STS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETPUMISCCMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISCCMPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETPUSCMOFFDATAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCMOFFDATAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETB:5;
      uint64_t reservedSpace0:2;
      uint64_t SPPDIS:1;
      uint64_t ERBA:5;
      uint64_t reservedSpace1:1;
      uint64_t CDFC:2;
      uint64_t FPSCK:3;
      uint64_t FCSS:1;
      uint64_t reservedSpace2:3;
      uint64_t HLTF:1;
      uint64_t reservedSpace3:4;
      uint64_t STF:1;
      uint64_t reservedSpace4:1;
      uint64_t MDIS:1;
      uint64_t FEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETB:5;
      uint64_t reservedSpace0:2;
      uint64_t SPPDIS:1;
      uint64_t ERBA:5;
      uint64_t reservedSpace1:1;
      uint64_t CDFC:2;
      uint64_t FPSCK:3;
      uint64_t FCSS:1;
      uint64_t reservedSpace2:3;
      uint64_t HLTF:1;
      uint64_t reservedSpace3:4;
      uint64_t STF:1;
      uint64_t reservedSpace4:1;
      uint64_t MDIS:1;
      uint64_t FEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR_ENG2;

