iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res40[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR20;

  uint8_t res41[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR20;

  uint8_t res42[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR21;

  uint8_t res43[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR21;

  uint8_t res44[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR22;

  uint8_t res45[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR22;

  uint8_t res46[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR23;

  uint8_t res47[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR23;

  uint8_t res48[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR24;

  uint8_t res49[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR24;

  uint8_t res50[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR25;

  uint8_t res51[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR25;

  uint8_t res52[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR26;

  uint8_t res53[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR26;

  uint8_t res54[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR27;

  uint8_t res55[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR27;

  uint8_t res56[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR28;

