iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res57[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR28;

  uint8_t res58[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR29;

  uint8_t res59[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR29;

  uint8_t res60[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR30;

  uint8_t res61[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR30;

  uint8_t res62[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR31;

  uint8_t res63[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR31;

};

#define IGF_0 (*(volatile struct IGF_0_tag *) 0xffce8000)

struct INTC_INTC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HVEN0:1;
      uint64_t reservedSpace0:3;
      uint64_t HVEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPROT:1;
      uint64_t reservedSpace0:3;
      uint64_t ID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPROT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPR1;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INTVEC:10;
      uint64_t VTBA:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IACKR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INTVEC:10;
      uint64_t VTBA:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IACKR1;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOIR1;

  uint8_t res3[8];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLR:1;
      uint64_t SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SSCIR31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR16;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR17;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR18;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR19;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR20;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR21;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR22;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR23;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR24;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR25;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR26;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR27;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR28;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR29;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR30;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR32;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR33;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR34;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR35;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR36;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR37;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR38;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR39;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR40;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR41;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR42;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR43;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR44;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR46;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR47;

