iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR878;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR879;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR880;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR881;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR882;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR883;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR884;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR885;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR886;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR887;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR888;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR889;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR890;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR891;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR892;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR893;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR894;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR895;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR896;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR897;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR898;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR899;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR900;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR901;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR902;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR903;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR904;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR905;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR906;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR907;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR908;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR909;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR910;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR911;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR912;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR913;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR914;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR915;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR916;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR917;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR918;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR919;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR920;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR921;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR922;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR923;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR924;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR925;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR926;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR927;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR928;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR929;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR930;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR931;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR932;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR933;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR934;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR935;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR936;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR937;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR938;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR939;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR940;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR941;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR942;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR943;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR944;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR945;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR946;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR947;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR948;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR949;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR950;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR951;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR952;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR953;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR954;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR955;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR956;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR957;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR958;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR959;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR960;

