iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res4[1952];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HIPRIC13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LATC13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERC13;

};

#define INTC_INTC_0 (*(volatile struct INTC_INTC_0_tag *) 0xfc040000)

struct IRCOSC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t USER_TRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define IRCOSC_0 (*(volatile struct IRCOSC_0_tag *) 0xfffb0000)

struct JDC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOUT_IEN:1;
      uint64_t reservedSpace0:15;
      uint64_t JIN_IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOUT_INT:1;
      uint64_t reservedSpace0:1;
      uint64_t JOUT_RDY:1;
      uint64_t reservedSpace1:13;
      uint64_t JIN_INT:1;
      uint64_t reservedSpace2:1;
      uint64_t JIN_RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JOUT_IPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JIN_IPS;

};

#define JDC_0 (*(volatile struct JDC_0_tag *) 0xfff3c000)

struct JTAGM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTM:1;
      uint64_t jtagm_JCOMP:1;
      uint64_t TCKSEL:3;
      uint64_t IIE:1;
      uint64_t SIE:1;
      uint64_t reservedSpace0:1;
      uint64_t inter_jtag_frame_timer:6;
      uint64_t reservedSpace1:17;
      uint64_t SWRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t NR:1;
      uint64_t Idle:1;
      uint64_t Nexus_err:1;
      uint64_t reservedSpace1:1;
      uint64_t SPU_INT:1;
      uint64_t SPU_INT_CLR:1;
      uint64_t reservedSpace2:2;
      uint64_t TOOL:1;
      uint64_t reservedSpace3:2;
      uint64_t JTAGSAFE:1;
      uint64_t reservedSpace4:1;
      uint64_t JTAGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMS_HIGH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t TMS_LOW:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDI_HIGH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEND:1;
      uint64_t reservedSpace0:3;
      uint64_t TDI_LOW:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOR3;

