iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFCNT:3;
      uint64_t reservedSpace0:5;
      uint64_t TXDCNT:6;
      uint64_t reservedSpace1:2;
      uint64_t RXFCNT:3;
      uint64_t reservedSpace2:5;
      uint64_t RXDCNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDTF:1;
      uint64_t TXICLCF:1;
      uint64_t TXUNSF:1;
      uint64_t reservedSpace0:1;
      uint64_t TXPNGF:1;
      uint64_t reservedSpace1:11;
      uint64_t TXOVF:1;
      uint64_t TXIEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXUNSF:1;
      uint64_t RXDF:1;
      uint64_t RXCTSF:1;
      uint64_t reservedSpace1:12;
      uint64_t RXLCEF:1;
      uint64_t RXICF:1;
      uint64_t RXSZF:1;
      uint64_t RXOFF:1;
      uint64_t RXUFF:1;
      uint64_t RXMXF:1;
      uint64_t RXMNF:1;
      uint64_t RXUOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICPONF:1;
      uint64_t ICPOFF:1;
      uint64_t ICTSF:1;
      uint64_t ICTFF:1;
      uint64_t ICRSF:1;
      uint64_t ICRFF:1;
      uint64_t ICTEF:1;
      uint64_t ICTDF:1;
      uint64_t ICCTF:1;
      uint64_t ICLPF:1;
      uint64_t ICTOF:1;
      uint64_t ICPRF:1;
      uint64_t ICPSF:1;
      uint64_t ICPFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRPDS:1;
      uint64_t LDPDS:1;
      uint64_t LDSLPS:1;
      uint64_t LRSLPS:1;
      uint64_t reservedSpace0:12;
      uint64_t PLDCR:1;
      uint64_t PLLDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t URPCNT:3;
      uint64_t reservedSpace0:5;
      uint64_t URXDV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNRXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSRDR8;

};

#define LFAST_0 (*(volatile struct LFAST_0_tag *) 0xfffd8000)

struct LINFlexD_LINFlexD_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t SLEEP:1;
      uint64_t RBLM:1;
      uint64_t SSBL:1;
      uint64_t MME:1;
      uint64_t LBKM:1;
      uint64_t reservedSpace0:1;
      uint64_t BF:1;
      uint64_t MBL:4;
      uint64_t AUTOWU:1;
      uint64_t LASE:1;
      uint64_t CFD:1;
      uint64_t CCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRIE:1;
      uint64_t DTIE:1;
      uint64_t DRIE:1;
      uint64_t DBEIETOIE:1;
      uint64_t DBFIE:1;
      uint64_t WUIE:1;
      uint64_t LSIE:1;
      uint64_t BOIE:1;
      uint64_t FEIE:1;
      uint64_t reservedSpace0:2;
      uint64_t HEIE:1;
      uint64_t CEIE:1;
      uint64_t BEIE:1;
      uint64_t OCIE:1;
      uint64_t SZIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRF:1;
      uint64_t DTF:1;
      uint64_t DRF:1;
      uint64_t DBEF:1;
      uint64_t DBFF:1;
      uint64_t WUF:1;
      uint64_t RDI:1;
      uint64_t RXbusy:1;
      uint64_t DRBNE:1;
      uint64_t RMB:1;
      uint64_t reservedSpace0:2;
      uint64_t LINS:4;
      uint64_t RDC:3;
      uint64_t AUTOSYNC_COMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NF:1;
      uint64_t reservedSpace0:6;
      uint64_t BOF:1;
      uint64_t FEF:1;
      uint64_t IDPEF:1;
      uint64_t SDEF:1;
      uint64_t SFEF:1;
      uint64_t CEF:1;
      uint64_t BEF:1;
      uint64_t OCF:1;
      uint64_t SZF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART:1;
      uint64_t WL0:1;
      uint64_t PCE:1;
      uint64_t PC0:1;
      uint64_t TxEn:1;
      uint64_t RxEn:1;
      uint64_t PC1:1;
      uint64_t WL1:1;
      uint64_t TFBM:1;
      uint64_t RFBM:1;
      uint64_t RDFL_RFC:3;
      uint64_t TDFL_TFC:3;
      uint64_t WLS:1;
      uint64_t SBUR:2;
      uint64_t DTU_PCETX:1;
      uint64_t NEF:3;
      uint64_t ROSE:1;
      uint64_t OSR:4;
      uint64_t CSP:3;
      uint64_t MIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NF:1;
      uint64_t DTFTFF:1;
      uint64_t DRFRFE:1;
      uint64_t TO:1;
      uint64_t RFNE:1;
      uint64_t WUF:1;
      uint64_t RDI:1;
      uint64_t BOF:1;
      uint64_t FEF:1;
      uint64_t RMB:1;
      uint64_t PE:4;
      uint64_t OCF:1;
      uint64_t SZF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:8;
      uint64_t TOCE:1;
      uint64_t IOT:1;
      uint64_t MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OC1:8;
      uint64_t OC2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTO:7;
      uint64_t reservedSpace0:1;
      uint64_t RTO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBR:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINIBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HTRQ:1;
      uint64_t ABRQ:1;
      uint64_t DTRQ:1;
      uint64_t DDRQ:1;
      uint64_t WURQ:1;
      uint64_t IOPE:1;
      uint64_t IOBE:1;
      uint64_t TBDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:8;
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA4:8;
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDRM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FACT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFMI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR:1;
      uint64_t STOP:1;
      uint64_t RDLIS:1;
      uint64_t TDLIS:1;
      uint64_t RDFBM:1;
      uint64_t TDFBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMATXE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMARXE;

