iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define LINFlexD_LINFlexD_5 (*(volatile struct LINFlexD_LINFlexD_5_tag *) 0xfbea8000)

struct MC_CGM_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SDUR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCS_SDUR;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATE:8;
      uint64_t reservedSpace0:8;
      uint64_t INIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVE:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATE:8;
      uint64_t reservedSpace0:8;
      uint64_t INIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVE:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVS2;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATE:8;
      uint64_t reservedSpace0:8;
      uint64_t INIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVE:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCS_DIVS4;

  uint8_t res2[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS_DIV_RATIO_CHNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC_DIV_RC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUX0_UPD_TYPE:1;
      uint64_t AUX1_UPD_TYPE:1;
      uint64_t AUX2_UPD_TYPE:1;
      uint64_t reservedSpace0:2;
      uint64_t AUX5_UPD_TYPE:1;
      uint64_t AUX6_UPD_TYPE:1;
      uint64_t reservedSpace1:1;
      uint64_t AUX8_UPD_TYPE:1;
      uint64_t AUX9_UPD_TYPE:1;
      uint64_t AUX10_UPD_TYPE:1;
      uint64_t reservedSpace2:20;
      uint64_t SYS_UPD_TYPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_UPD_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_UPD_TRIGGER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_UPD_TRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUX0_UPD_STAT:1;
      uint64_t AUX1_UPD_STAT:1;
      uint64_t AUX2_UPD_STAT:1;
      uint64_t reservedSpace0:2;
      uint64_t AUX5_UPD_STAT:1;
      uint64_t AUX6_UPD_STAT:1;
      uint64_t reservedSpace1:1;
      uint64_t AUX8_UPD_STAT:1;
      uint64_t AUX9_UPD_STAT:1;
      uint64_t AUX10_UPD_STAT:1;
      uint64_t reservedSpace2:20;
      uint64_t SYS_UPD_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_UPD_STAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace1:4;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC_DC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC_DC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SC_DC2;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_DC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:7;
      uint64_t reservedSpace1:8;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_DC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:7;
      uint64_t reservedSpace1:8;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_DC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FMT:2;
      uint64_t reservedSpace0:14;
      uint64_t DIV:13;
      uint64_t reservedSpace1:2;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_DC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC0_DC4;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC1_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC1_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reserved:16;
      uint64_t DIV:7;
      uint64_t reservedSpace0:8;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC1_DC0;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC2_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC2_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC2_DC0;

  uint8_t res7[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC3_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC3_SS;

  uint8_t res8[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC4_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC4_SS;

  uint8_t res9[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC5_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC5_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC5_DC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC5_DC1;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC6_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC6_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC6_DC0;

  uint8_t res11[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC8_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC8_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC8_DC0;

