iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res12[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC9_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC9_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC9_DC0;

  uint8_t res13[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC10_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC10_SS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AC10_DC0;

};

#define MC_CGM_0 (*(volatile struct MC_CGM_0_tag *) 0xfffb0700)

struct MC_ME_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_SYSCLK:4;
      uint64_t S_IRC:1;
      uint64_t S_XOSC:1;
      uint64_t S_PLL0:1;
      uint64_t S_PLL1:1;
      uint64_t reservedSpace0:8;
      uint64_t S_FLA:2;
      uint64_t reservedSpace1:2;
      uint64_t S_MVR:1;
      uint64_t reservedSpace2:2;
      uint64_t S_PDO:1;
      uint64_t reservedSpace3:3;
      uint64_t S_MTRANS:1;
      uint64_t S_CURRENT_MODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
      uint64_t reservedSpace0:12;
      uint64_t TARGET_MODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_FUNC:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:4;
      uint64_t RESET_DEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I_MTC:1;
      uint64_t I_SAFE:1;
      uint64_t I_IMODE:1;
      uint64_t I_ICONF:1;
      uint64_t I_CONF_CU:1;
      uint64_t I_ICONF_CC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M_MTC:1;
      uint64_t M_SAFE:1;
      uint64_t M_IMODE:1;
      uint64_t M_ICONF:1;
      uint64_t M_ICONF_CU:1;
      uint64_t M_ICONF_CC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_SEA:1;
      uint64_t S_NMA:1;
      uint64_t S_DMA:1;
      uint64_t S_MRI:1;
      uint64_t S_MTI:1;
      uint64_t S_MRIG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDP_PRPH_0_31:1;
      uint64_t CDP_PRPH_32_63:1;
      uint64_t CDP_PRPH_64_95:1;
      uint64_t CDP_PRPH_96_127:1;
      uint64_t CDP_PRPH_128_159:1;
      uint64_t CDP_PRPH_160_191:1;
      uint64_t CDP_PRPH_192_223:1;
      uint64_t CDP_PRPH_244_255:1;
      uint64_t FLASH_SC:1;
      uint64_t reservedSpace0:1;
      uint64_t SYSCLK_SW:1;
      uint64_t SCSRC_SC:1;
      uint64_t IRC_SC:1;
      uint64_t CSRC_CSRC_SC:1;
      uint64_t VREG_CSRC_SC:1;
      uint64_t CDP_PRPH_0_255:1;
      uint64_t SMR:1;
      uint64_t PCS_PROG:1;
      uint64_t CCKL_PROG:1;
      uint64_t DBG_MODE:1;
      uint64_t PMC_PROG:1;
      uint64_t reservedSpace1:2;
      uint64_t MPH_BUSY:1;
      uint64_t reservedSpace2:4;
      uint64_t PREVIOUS_MODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMTS;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL10N:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAFE_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRUN_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN0_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN1_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN2_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN3_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HALT0_MC;

