iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t IRCON:1;
      uint64_t XOSCON:1;
      uint64_t PLL0ON:1;
      uint64_t PLL1ON:1;
      uint64_t reservedSpace0:8;
      uint64_t FLAON:2;
      uint64_t reservedSpace1:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace2:2;
      uint64_t PDO:1;
      uint64_t reservedSpace3:4;
      uint64_t PWRLVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STOP0_MC;

  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t S_LFAST_0:1;
      uint64_t reservedSpace1:1;
      uint64_t S_SIPI_0:1;
      uint64_t reservedSpace2:3;
      uint64_t S_SIUL2_0:1;
      uint64_t reserved:12;
      uint64_t S_DECFILT_1:1;
      uint64_t S_DECFILT_0:1;
      uint64_t S_PIT_RTI_0:1;
      uint64_t S_PIT_RTI_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t S_DMA_CH_MUX0_2:1;
      uint64_t reservedSpace1:1;
      uint64_t S_CRC_0:1;
      uint64_t reservedSpace2:6;
      uint64_t S_JTAGM_0:1;
      uint64_t reservedSpace3:13;
      uint64_t S_ADCSD_2:1;
      uint64_t S_ADCSD_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t S_ADCSAR_2:1;
      uint64_t reservedSpace1:1;
      uint64_t S_ADCSAR_0:1;
      uint64_t reservedSpace2:9;
      uint64_t S_FLEXCAN_2:1;
      uint64_t reservedSpace3:1;
      uint64_t S_FLEXCAN_0:1;
      uint64_t reservedSpace4:1;
      uint64_t S_LINFLEX_M0:1;
      uint64_t reservedSpace5:5;
      uint64_t S_LINFLEX_2:1;
      uint64_t S_LINFLEX_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_DSPI_M0:1;
      uint64_t S_DSPI_4:1;
      uint64_t S_DSPI_2:1;
      uint64_t S_DSPI_0:1;
      uint64_t reservedSpace0:2;
      uint64_t S_EMIOS_0:1;
      uint64_t reservedSpace1:1;
      uint64_t S_SENT_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t S_DMA_CH_MUX3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t CRC_1:1;
      uint64_t reservedSpace1:21;
      uint64_t ADC_SD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ADCSAR_3:1;
      uint64_t IGF_bitfield:1;
      uint64_t ADCSAR_1:1;
      uint64_t reservedSpace1:3;
      uint64_t ETPU_SCRAM1:1;
      uint64_t ETPU_SCRAM0:1;
      uint64_t ETPU_SPRAM1:1;
      uint64_t ETPU_SPRAM0:1;
      uint64_t REACM:1;
      uint64_t ETPU:1;
      uint64_t FLEXCAN3:1;
      uint64_t reservedSpace2:1;
      uint64_t FLEXCAN1:1;
      uint64_t reservedSpace3:2;
      uint64_t LINFLEX_M1:1;
      uint64_t reservedSpace4:5;
      uint64_t LINFLEX_3:1;
      uint64_t LINFLEX_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DSPI_M1:1;
      uint64_t DSPI_3:1;
      uint64_t DSPI_1:1;
      uint64_t reservedSpace1:2;
      uint64_t EMIOS_1:1;
      uint64_t reservedSpace2:1;
      uint64_t SENT_1:1;
      uint64_t reservedSpace3:18;
      uint64_t BCTU_1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN_PC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HATL0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LP_PC7;

  uint8_t res3[9];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL9;

  uint8_t res4[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL11;

