iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res5[16];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL31;

  uint8_t res6[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL36;

  uint8_t res7[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL38;

  uint8_t res8[6];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL45;

  uint8_t res9[13];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL60;

  uint8_t res10[8];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL69;

  uint8_t res11[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL71;

  uint8_t res12[9];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL81;

  uint8_t res13[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL83;

  uint8_t res14[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL85;

  uint8_t res15[5];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL92;

  uint8_t res16[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL99;

  uint8_t res17[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL102;

  uint8_t res18[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL104;

  uint8_t res19[38];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL143;

  uint8_t res20[22];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL166;

  uint8_t res21[21];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL188;

  uint8_t res22[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL198;

  uint8_t res23[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL208;

  uint8_t res24[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL210;

  uint8_t res25[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL213;

  uint8_t res26[5];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL220;

  uint8_t res27[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL225;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL226;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL227;

  uint8_t res28[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL230;

  uint8_t res29[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL232;

