iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DRET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DRET;

};

#define MC_RGM_0 (*(volatile struct MC_RGM_0_tag *) 0xfffa8000)

struct MEMU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t SWR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR_EBO:1;
      uint64_t SR_UCO:1;
      uint64_t SR_CEO:1;
      uint64_t SR_UCE:1;
      uint64_t SR_CE:1;
      uint64_t reservedSpace0:3;
      uint64_t F_EBO:1;
      uint64_t F_UCO:1;
      uint64_t F_CEO:1;
      uint64_t F_UCE:1;
      uint64_t F_CE:1;
      uint64_t reservedSpace1:3;
      uint64_t PR_EBO:1;
      uint64_t PR_UCO:1;
      uint64_t PR_CEO:1;
      uint64_t PR_UCE:1;
      uint64_t PR_CE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_FLAG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FR_SR_EBO:1;
      uint64_t FR_SR_UCO:1;
      uint64_t FR_SR_CEO:1;
      uint64_t FR_SR_UCE:1;
      uint64_t FR_SR_CE:1;
      uint64_t reservedSpace0:3;
      uint64_t FR_F_EBO:1;
      uint64_t FR_F_UCO:1;
      uint64_t FR_F_CEO:1;
      uint64_t FR_F_UCE:1;
      uint64_t FR_F_CE:1;
      uint64_t reservedSpace1:3;
      uint64_t FR_PR_EBO:1;
      uint64_t FR_PR_UCO:1;
      uint64_t FR_PR_CEO:1;
      uint64_t FR_PR_UCE:1;
      uint64_t FR_PR_CE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_STS9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_CERR_ADDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_UNCERR_STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_UNCERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFLW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_RAM_OFLW0;

  uint8_t res2[1444];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_CERR_STS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_CERR_ADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_CERR_STS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_CERR_ADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_UNCERR_STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_UNCERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFLW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_RAM_OFLW0;

