iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res3[1508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAD_BIT:8;
      uint64_t reservedSpace0:23;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_STS19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CERR_ADDR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_UNCERR_STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR_ADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_UNCERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFLW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_OFLW0;

