iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word23;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word24;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word25;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word26;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word27;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word28;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word29;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word010;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word210;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word011;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word211;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word012;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word212;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word013;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word213;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word014;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word214;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word015;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word215;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word016;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word216;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word017;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word217;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word018;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word218;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word019;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word219;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word020;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word220;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word021;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word221;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word022;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word222;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word223;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word024;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word224;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word025;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word225;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word026;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word226;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word027;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word227;

