iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word028;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word228;

  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word029;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word229;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word030;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word230;

  uint8_t res31[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word031;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word231;

};

#define PFLASH_0 (*(volatile struct PFLASH_0_tag *) 0xfc030000)

struct PIT_PIT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
      uint64_t MDIS_RTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTMR64H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTMR64L;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_TFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG7;

