iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define PMC_0 (*(volatile struct PMC_0_tag *) 0xfffa04a4)

struct PRAMC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FT_DIS:1;
      uint64_t reservedSpace0:5;
      uint64_t P0_BO_DIS:1;
      uint64_t P1_BO_DIS:1;
      uint64_t PRI:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCR1;

};

#define PRAMC_0 (*(volatile struct PRAMC_0_tag *) 0xfc020000)

struct REACM2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t OVREN:1;
      uint64_t GIEN:1;
      uint64_t HPREN:1;
      uint64_t TPREN:1;
      uint64_t FREN:1;
      uint64_t reservedSpace1:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
      uint64_t OVRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPRE:8;
      uint64_t reservedSpace0:8;
      uint64_t HPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRADC0:4;
      uint64_t reservedSpace0:4;
      uint64_t THRADC1:4;
      uint64_t reservedSpace1:12;
      uint64_t WREN0:1;
      uint64_t WREN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_RESULT:16;
      uint64_t ADC_TAG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PER:16;
      uint64_t PERPRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EF0:1;
      uint64_t EF1:1;
      uint64_t EF2:1;
      uint64_t EF3:1;
      uint64_t EF4:1;
      uint64_t EF5:1;
      uint64_t EF6:1;
      uint64_t EF7:1;
      uint64_t EF8:1;
      uint64_t EF9:1;
      uint64_t reservedSpace0:21;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GEFR;

  uint8_t res2[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR2;

