iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR3;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR4;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR5;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR6;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR7;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR8;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t BSB:3;
      uint64_t reservedSpace1:5;
      uint64_t DOFF:3;
      uint64_t reservedSpace2:1;
      uint64_t SDCM:1;
      uint64_t CHOFF:1;
      uint64_t DMAEN:1;
      uint64_t RAEREN:1;
      uint64_t SQEREN:1;
      uint64_t TAEREN:1;
      uint64_t SCDFEN:1;
      uint64_t OCDFEN:1;
      uint64_t MAXLEN:1;
      uint64_t SWMC:1;
      uint64_t CHEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODULATION_POINTER:6;
      uint64_t reservedSpace0:1;
      uint64_t RAERC:1;
      uint64_t SQERC:1;
      uint64_t TAERC:1;
      uint64_t SCDFC:1;
      uint64_t OCDFC:1;
      uint64_t MAXLC:1;
      uint64_t reservedSpace1:7;
      uint64_t CHOUT:3;
      uint64_t RAER:1;
      uint64_t SQER:1;
      uint64_t TAER:1;
      uint64_t SCDF:1;
      uint64_t OCDF:1;
      uint64_t MAXL:1;
      uint64_t MODACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIR:4;
      uint64_t reservedSpace0:12;
      uint64_t ADCR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHRR9;

  uint8_t res12[356];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHARED_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHARED_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHARED_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHARED_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHARED_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STBK4;

  uint8_t res13[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOLD_TIM:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOTBK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOLD_TIM:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOTBK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOLD_TIM:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOTBK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOLD_TIM:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOTBK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOLD_TIM:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HOTBK4;

  uint8_t res14[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THBK31;

  uint8_t res15[384];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_MAX_LIMIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCMAX;

  uint8_t res16[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_PWD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_PWD;

