iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res17[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIN_PWD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIN_PWD;

  uint8_t res18[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HDOFFTPT:3;
      uint64_t reservedSpace0:2;
      uint64_t STPT:3;
      uint64_t reservedSpace1:1;
      uint64_t THRESPT:5;
      uint64_t reservedSpace2:2;
      uint64_t LOD:3;
      uint64_t reservedSpace3:1;
      uint64_t HOD:3;
      uint64_t reservedSpace4:1;
      uint64_t SM:2;
      uint64_t reservedSpace5:1;
      uint64_t MM:2;
      uint64_t DMA:1;
      uint64_t IOSS:1;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MWBK31;

