iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define REACM2_0 (*(volatile struct REACM2_0_tag *) 0xffcc4000)

struct SDADC_SDADC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MODE:1;
      uint64_t GECEN:1;
      uint64_t WRMODE:1;
      uint64_t VCOMSEL:1;
      uint64_t reservedSpace0:2;
      uint64_t FRZ:1;
      uint64_t TRIGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t TRIGEN:1;
      uint64_t TRIGEDSEL:2;
      uint64_t WDGEN:1;
      uint64_t HPFEN:1;
      uint64_t reservedSpace2:3;
      uint64_t PGAN:3;
      uint64_t reservedSpace3:1;
      uint64_t PDR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANCHSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t ANCHSEL_WRAP:3;
      uint64_t reservedSpace1:5;
      uint64_t BIASEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFF:1;
      uint64_t DFORF:1;
      uint64_t CDVF:1;
      uint64_t WTHL:1;
      uint64_t WTHH:1;
      uint64_t reservedSpace0:3;
      uint64_t DFEF:1;
      uint64_t reservedSpace1:7;
      uint64_t ANCHSEL_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFDIRE:1;
      uint64_t DFORIE:1;
      uint64_t CDVEE:1;
      uint64_t WTHDIRE:1;
      uint64_t reservedSpace0:11;
      uint64_t GDIGE:1;
      uint64_t DFFDIRS:1;
      uint64_t WTHDIRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FE:1;
      uint64_t FSIZE:2;
      uint64_t reservedSpace0:5;
      uint64_t FTHLD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:16;
      uint64_t THRH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHHLR;

};

#define SDADC_SDADC_0 (*(volatile struct SDADC_SDADC_0_tag *) 0xfff0c000)

struct SDADC_SDADC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MODE:1;
      uint64_t GECEN:1;
      uint64_t WRMODE:1;
      uint64_t VCOMSEL:1;
      uint64_t reservedSpace0:2;
      uint64_t FRZ:1;
      uint64_t TRIGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t TRIGEN:1;
      uint64_t TRIGEDSEL:2;
      uint64_t WDGEN:1;
      uint64_t HPFEN:1;
      uint64_t reservedSpace2:3;
      uint64_t PGAN:3;
      uint64_t reservedSpace3:1;
      uint64_t PDR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANCHSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t ANCHSEL_WRAP:3;
      uint64_t reservedSpace1:5;
      uint64_t BIASEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFF:1;
      uint64_t DFORF:1;
      uint64_t CDVF:1;
      uint64_t WTHL:1;
      uint64_t WTHH:1;
      uint64_t reservedSpace0:3;
      uint64_t DFEF:1;
      uint64_t reservedSpace1:7;
      uint64_t ANCHSEL_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFDIRE:1;
      uint64_t DFORIE:1;
      uint64_t CDVEE:1;
      uint64_t WTHDIRE:1;
      uint64_t reservedSpace0:11;
      uint64_t GDIGE:1;
      uint64_t DFFDIRS:1;
      uint64_t WTHDIRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FE:1;
      uint64_t FSIZE:2;
      uint64_t reservedSpace0:5;
      uint64_t FTHLD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:16;
      uint64_t THRH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHHLR;

};

#define SDADC_SDADC_1 (*(volatile struct SDADC_SDADC_1_tag *) 0xfbf0c000)

struct SDADC_SDADC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MODE:1;
      uint64_t GECEN:1;
      uint64_t WRMODE:1;
      uint64_t VCOMSEL:1;
      uint64_t reservedSpace0:2;
      uint64_t FRZ:1;
      uint64_t TRIGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t TRIGEN:1;
      uint64_t TRIGEDSEL:2;
      uint64_t WDGEN:1;
      uint64_t HPFEN:1;
      uint64_t reservedSpace2:3;
      uint64_t PGAN:3;
      uint64_t reservedSpace3:1;
      uint64_t PDR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANCHSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t ANCHSEL_WRAP:3;
      uint64_t reservedSpace1:5;
      uint64_t BIASEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFF:1;
      uint64_t DFORF:1;
      uint64_t CDVF:1;
      uint64_t WTHL:1;
      uint64_t WTHH:1;
      uint64_t reservedSpace0:3;
      uint64_t DFEF:1;
      uint64_t reservedSpace1:7;
      uint64_t ANCHSEL_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFDIRE:1;
      uint64_t DFORIE:1;
      uint64_t CDVEE:1;
      uint64_t WTHDIRE:1;
      uint64_t reservedSpace0:11;
      uint64_t GDIGE:1;
      uint64_t DFFDIRS:1;
      uint64_t WTHDIRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FE:1;
      uint64_t FSIZE:2;
      uint64_t reservedSpace0:5;
      uint64_t FTHLD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:16;
      uint64_t THRH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHHLR;

