iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKIE:1;
      uint64_t TIDIE:1;
      uint64_t TOIE:1;
      uint64_t TCIE:1;
      uint64_t RAIE:1;
      uint64_t WAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTOR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCT:16;
      uint64_t CRCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCRC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR2_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t WRT:1;
      uint64_t RRT:1;
      uint64_t IDT:1;
      uint64_t ST:1;
      uint64_t CHEN:1;
      uint64_t WL:2;
      uint64_t reservedSpace0:8;
      uint64_t TC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CB:1;
      uint64_t ACKR:1;
      uint64_t TID:3;
      uint64_t RAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR3;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKIE:1;
      uint64_t TIDIE:1;
      uint64_t TOIE:1;
      uint64_t TCIE:1;
      uint64_t RAIE:1;
      uint64_t WAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTOR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCT:16;
      uint64_t CRCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCRC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR:1;
      uint64_t MOEN:1;
      uint64_t INIT:1;
      uint64_t TEN:1;
      uint64_t CHNSB:1;
      uint64_t reservedSpace0:4;
      uint64_t MCRIE:1;
      uint64_t CRCIE:1;
      uint64_t reservedSpace1:3;
      uint64_t AID:2;
      uint64_t PRSCLR:11;
      uint64_t reservedSpace2:2;
      uint64_t HALT:1;
      uint64_t reservedSpace3:1;
      uint64_t FRZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATE:4;
      uint64_t TE:4;
      uint64_t reservedSpace0:1;
      uint64_t MCR:1;
      uint64_t GCRCE:1;
      uint64_t reservedSpace1:19;
      uint64_t LPMACK:1;
      uint64_t FRZACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t MXCNT:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAXCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADRLD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADCNT:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKE0:1;
      uint64_t TIDE0:1;
      uint64_t TOE0:1;
      uint64_t reservedSpace0:5;
      uint64_t ACKE1:1;
      uint64_t TIDE1:1;
      uint64_t TOE1:1;
      uint64_t reservedSpace1:5;
      uint64_t ACKE2:1;
      uint64_t TIDE2:1;
      uint64_t TOE2:1;
      uint64_t reservedSpace2:5;
      uint64_t ACKE3:1;
      uint64_t TIDE3:1;
      uint64_t TOE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR;

};

#define SIPI_0 (*(volatile struct SIPI_0_tag *) 0xfffd0000)

struct SIUL2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR_MASK:4;
      uint64_t MAJOR_MASK:4;
      uint64_t reservedSpace0:2;
      uint64_t PKG:5;
      uint64_t ED:1;
      uint64_t PARTNUM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PARTNUM:8;
      uint64_t reservedSpace1:7;
      uint64_t FLASH_SIZE_2:4;
      uint64_t FLASH_SIZE_1:4;
      uint64_t SF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF0:1;
      uint64_t EIF1:1;
      uint64_t EIF2:1;
      uint64_t EIF3:1;
      uint64_t EIF4:1;
      uint64_t EIF5:1;
      uint64_t EIF6:1;
      uint64_t EIF7:1;
      uint64_t EIF8:1;
      uint64_t EIF9:1;
      uint64_t EIF10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DISR0;

