iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res7[60];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t FEC_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCR00;

  uint8_t res8[318];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR57;

