iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR115;

