iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR255;

  uint8_t res9[1024];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR512;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR513;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR514;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR515;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR516;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR517;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR519;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR520;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR521;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR522;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR523;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR524;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR525;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR526;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR527;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR528;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR529;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR530;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR531;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR532;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR533;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR534;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR535;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR536;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR537;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR538;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR539;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR540;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR541;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR542;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR543;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR544;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR545;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR546;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR547;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR548;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR549;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR550;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR551;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR552;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR553;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR554;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR555;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR556;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR557;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR558;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR559;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR560;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR561;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR562;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR563;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR564;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR565;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR566;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR567;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR568;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR569;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR570;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR571;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR572;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR573;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR574;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR575;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR576;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR577;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR578;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR579;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR580;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR581;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR582;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR583;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR584;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR585;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR586;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR587;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR588;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR589;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR590;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR591;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR592;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR593;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR594;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR595;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR596;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR597;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR598;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR599;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR600;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR601;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR602;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR603;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR604;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR605;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR606;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR607;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR608;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR609;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR610;

