iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI216;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI220;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI221;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI222;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI223;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI224;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI225;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI226;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI227;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI228;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI229;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI230;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI231;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI232;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI233;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI234;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI235;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI236;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI237;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI238;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI239;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI240;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI241;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI242;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI243;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI244;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI245;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI246;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI247;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI248;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI249;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI250;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI251;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI252;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI253;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI254;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI255;

  uint8_t res13[256];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO15;

  uint8_t res14[32];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI15;

  uint8_t res15[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPPDO:16;
      uint64_t MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPGPDO15;

