iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define SRX_SRX_1 (*(volatile struct SRX_SRX_1_tag *) 0xfbe5c000)

struct SSCM_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t VLE:1;
      uint64_t BMODE:3;
      uint64_t reservedSpace1:3;
      uint64_t NXEN:1;
      uint64_t NXEN1:1;
      uint64_t CERS:1;
      uint64_t CER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) STATUS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MREV:4;
      uint64_t reservedSpace1:1;
      uint64_t JPIN:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MEMCONFIG;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSA;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCSTAT;

};

#define SSCM_0 (*(volatile struct SSCM_0_tag *) 0xffff8000)

struct STCU2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUN:1;
      uint64_t reservedSpace0:7;
      uint64_t LBPLLEN:1;
      uint64_t MBPLLEN:1;
      uint64_t BYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNSW:1;
      uint64_t RUNSW_ABORT:1;
      uint64_t reservedSpace0:6;
      uint64_t LBSWPLLEN:1;
      uint64_t MBSWPLLEN:1;
      uint64_t LBIE:1;
      uint64_t MBIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUNSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SKC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SKC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_CFG:3;
      uint64_t MBU:1;
      uint64_t PMOSEN:1;
      uint64_t reservedSpace0:3;
      uint64_t WRP:1;
      uint64_t reservedSpace1:15;
      uint64_t PTR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLLDF:7;
      uint64_t reservedSpace0:9;
      uint64_t PLLIDF:3;
      uint64_t reservedSpace1:5;
      uint64_t PLLODF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDGEOC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBIFLG:1;
      uint64_t MBIFLG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_FLG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVP:1;
      uint64_t ENGE:1;
      uint64_t reservedSpace0:1;
      uint64_t WDTO:1;
      uint64_t LOCKE:1;
      uint64_t reservedSpace1:3;
      uint64_t RFSF:1;
      uint64_t UFSF:1;
      uint64_t reservedSpace2:6;
      uint64_t INVPSW:1;
      uint64_t ENGESW:1;
      uint64_t reservedSpace3:1;
      uint64_t WDTOSW:1;
      uint64_t LOCKESW:1;
      uint64_t reservedSpace4:3;
      uint64_t ABORTSW:1;
      uint64_t ABORTHW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVPUFM:1;
      uint64_t ENGEUFM:1;
      uint64_t reservedSpace0:1;
      uint64_t WDTOUFM:1;
      uint64_t LOCKEUFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_FM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBS0:1;
      uint64_t LBS1:1;
      uint64_t LBS2:1;
      uint64_t LBS3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBE0:1;
      uint64_t LBE1:1;
      uint64_t LBE2:1;
      uint64_t LBE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBSSW0:1;
      uint64_t LBSSW1:1;
      uint64_t LBSSW2:1;
      uint64_t LBSSW3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBSSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBESW0:1;
      uint64_t LBESW1:1;
      uint64_t LBESW2:1;
      uint64_t LBESW3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBESW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBRMSW0:1;
      uint64_t LBRMSW1:1;
      uint64_t LBRMSW2:1;
      uint64_t LBRMSW3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBRMSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBUFM0:1;
      uint64_t LBUFM1:1;
      uint64_t LBUFM2:1;
      uint64_t LBUFM3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBUFM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBS0:1;
      uint64_t MBS1:1;
      uint64_t MBS2:1;
      uint64_t MBS3:1;
      uint64_t MBS4:1;
      uint64_t MBS5:1;
      uint64_t MBS6:1;
      uint64_t MBS7:1;
      uint64_t MBS8:1;
      uint64_t MBS9:1;
      uint64_t MBS10:1;
      uint64_t MBS11:1;
      uint64_t MBS12:1;
      uint64_t MBS13:1;
      uint64_t MBS14:1;
      uint64_t MBS15:1;
      uint64_t MBS16:1;
      uint64_t MBS17:1;
      uint64_t MBS18:1;
      uint64_t MBS19:1;
      uint64_t MBS20:1;
      uint64_t MBS21:1;
      uint64_t MBS22:1;
      uint64_t MBS23:1;
      uint64_t MBS24:1;
      uint64_t MBS25:1;
      uint64_t MBS26:1;
      uint64_t MBS27:1;
      uint64_t MBS28:1;
      uint64_t MBS29:1;
      uint64_t MBS30:1;
      uint64_t MBS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBSL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBS32:1;
      uint64_t MBS33:1;
      uint64_t MBS34:1;
      uint64_t MBS35:1;
      uint64_t MBS36:1;
      uint64_t MBS37:1;
      uint64_t MBS38:1;
      uint64_t MBS39:1;
      uint64_t MBS40:1;
      uint64_t MBS41:1;
      uint64_t MBS42:1;
      uint64_t MBS43:1;
      uint64_t MBS44:1;
      uint64_t MBS45:1;
      uint64_t MBS46:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBSM;

