iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define ADC_ADC_0 (*(volatile struct ADC_ADC_0_tag *) 0xffee0000)

struct ADC_ADC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t REFSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t ABORT:1;
      uint64_t ABORT_CHAIN:1;
      uint64_t ADCLKSEL:1;
      uint64_t reservedSpace1:6;
      uint64_t STCL:1;
      uint64_t CTU_MODE:1;
      uint64_t CTUEN:1;
      uint64_t reservedSpace2:2;
      uint64_t JSTART:1;
      uint64_t reservedSpace3:3;
      uint64_t NSTART:1;
      uint64_t reservedSpace4:1;
      uint64_t EDGE:1;
      uint64_t TRGEN:1;
      uint64_t reservedSpace5:1;
      uint64_t MODE:1;
      uint64_t WLSIDE:1;
      uint64_t OWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCSTATUS:3;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t reservedSpace1:3;
      uint64_t CHADDR:7;
      uint64_t CTUSTART:1;
      uint64_t reservedSpace2:1;
      uint64_t SELF_TEST_S:1;
      uint64_t reservedSpace3:1;
      uint64_t JSTART:1;
      uint64_t reservedSpace4:2;
      uint64_t JABORT:1;
      uint64_t NSTART:1;
      uint64_t reservedSpace5:6;
      uint64_t CALIBRTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECH:1;
      uint64_t EOC:1;
      uint64_t JECH:1;
      uint64_t JEOC:1;
      uint64_t EOCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOCCH0:1;
      uint64_t EOCCH1:1;
      uint64_t EOCCH2:1;
      uint64_t EOCCH3:1;
      uint64_t EOCCH4:1;
      uint64_t EOCCH5:1;
      uint64_t EOCCH6:1;
      uint64_t EOCCH7:1;
      uint64_t EOCCH8:1;
      uint64_t EOCCH9:1;
      uint64_t EOCCH10:1;
      uint64_t EOCCH11:1;
      uint64_t EOCCH12:1;
      uint64_t EOCCH13:1;
      uint64_t EOCCH14:1;
      uint64_t EOCCH15:1;
      uint64_t EOCCH16:1;
      uint64_t EOCCH17:1;
      uint64_t EOCCH18:1;
      uint64_t EOCCH19:1;
      uint64_t EOCCH20:1;
      uint64_t EOCCH21:1;
      uint64_t EOCCH22:1;
      uint64_t EOCCH23:1;
      uint64_t EOCCH24:1;
      uint64_t EOCCH25:1;
      uint64_t EOCCH26:1;
      uint64_t EOCCH27:1;
      uint64_t EOCCH28:1;
      uint64_t EOCCH29:1;
      uint64_t EOCCH30:1;
      uint64_t EOCCH31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOCCH32:1;
      uint64_t EOCCH33:1;
      uint64_t EOCCH34:1;
      uint64_t EOCCH35:1;
      uint64_t EOCCH36:1;
      uint64_t EOCCH37:1;
      uint64_t EOCCH38:1;
      uint64_t EOCCH39:1;
      uint64_t EOCCH40:1;
      uint64_t EOCCH41:1;
      uint64_t EOCCH42:1;
      uint64_t EOCCH43:1;
      uint64_t EOCCH44:1;
      uint64_t EOCCH45:1;
      uint64_t EOCCH46:1;
      uint64_t EOCCH47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOCCH64:1;
      uint64_t EOCCH65:1;
      uint64_t EOCCH66:1;
      uint64_t EOCCH67:1;
      uint64_t EOCCH68:1;
      uint64_t EOCCH69:1;
      uint64_t EOCCH70:1;
      uint64_t EOCCH71:1;
      uint64_t EOCCH72:1;
      uint64_t EOCCH73:1;
      uint64_t EOCCH74:1;
      uint64_t EOCCH75:1;
      uint64_t EOCCH76:1;
      uint64_t EOCCH77:1;
      uint64_t EOCCH78:1;
      uint64_t EOCCH79:1;
      uint64_t EOCCH80:1;
      uint64_t EOCCH81:1;
      uint64_t EOCCH82:1;
      uint64_t EOCCH83:1;
      uint64_t EOCCH84:1;
      uint64_t EOCCH85:1;
      uint64_t EOCCH86:1;
      uint64_t EOCCH87:1;
      uint64_t EOCCH88:1;
      uint64_t EOCCH89:1;
      uint64_t EOCCH90:1;
      uint64_t EOCCH91:1;
      uint64_t EOCCH92:1;
      uint64_t EOCCH93:1;
      uint64_t EOCCH94:1;
      uint64_t EOCCH95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKECH:1;
      uint64_t MSKEOC:1;
      uint64_t MSKJECH:1;
      uint64_t MSKJEOC:1;
      uint64_t MSKEOCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIM0:1;
      uint64_t CIM1:1;
      uint64_t CIM2:1;
      uint64_t CIM3:1;
      uint64_t CIM4:1;
      uint64_t CIM5:1;
      uint64_t CIM6:1;
      uint64_t CIM7:1;
      uint64_t CIM8:1;
      uint64_t CIM9:1;
      uint64_t CIM10:1;
      uint64_t CIM11:1;
      uint64_t CIM12:1;
      uint64_t CIM13:1;
      uint64_t CIM14:1;
      uint64_t CIM15:1;
      uint64_t CIM16:1;
      uint64_t CIM17:1;
      uint64_t CIM18:1;
      uint64_t CIM19:1;
      uint64_t CIM20:1;
      uint64_t CIM21:1;
      uint64_t CIM22:1;
      uint64_t CIM23:1;
      uint64_t CIM24:1;
      uint64_t CIM25:1;
      uint64_t CIM26:1;
      uint64_t CIM27:1;
      uint64_t CIM28:1;
      uint64_t CIM29:1;
      uint64_t CIM30:1;
      uint64_t CIM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIM32:1;
      uint64_t CIM33:1;
      uint64_t CIM34:1;
      uint64_t CIM35:1;
      uint64_t CIM36:1;
      uint64_t CIM37:1;
      uint64_t CIM38:1;
      uint64_t CIM39:1;
      uint64_t CIM40:1;
      uint64_t CIM41:1;
      uint64_t CIM42:1;
      uint64_t CIM43:1;
      uint64_t CIM44:1;
      uint64_t CIM45:1;
      uint64_t CIM46:1;
      uint64_t CIM47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIM64:1;
      uint64_t CIM65:1;
      uint64_t CIM66:1;
      uint64_t CIM67:1;
      uint64_t CIM68:1;
      uint64_t CIM69:1;
      uint64_t CIM70:1;
      uint64_t CIM71:1;
      uint64_t CIM72:1;
      uint64_t CIM73:1;
      uint64_t CIM74:1;
      uint64_t CIM75:1;
      uint64_t CIM76:1;
      uint64_t CIM77:1;
      uint64_t CIM78:1;
      uint64_t CIM79:1;
      uint64_t CIM80:1;
      uint64_t CIM81:1;
      uint64_t CIM82:1;
      uint64_t CIM83:1;
      uint64_t CIM84:1;
      uint64_t CIM85:1;
      uint64_t CIM86:1;
      uint64_t CIM87:1;
      uint64_t CIM88:1;
      uint64_t CIM89:1;
      uint64_t CIM90:1;
      uint64_t CIM91:1;
      uint64_t CIM92:1;
      uint64_t CIM93:1;
      uint64_t CIM94:1;
      uint64_t CIM95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDG0L:1;
      uint64_t WDG0H:1;
      uint64_t WDG1L:1;
      uint64_t WDG1H:1;
      uint64_t WDG2L:1;
      uint64_t WDG2H:1;
      uint64_t WDG3L:1;
      uint64_t WDG3H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKWDG0L:1;
      uint64_t MSKWDG0H:1;
      uint64_t MSKWDG1L:1;
      uint64_t MSKWDG1H:1;
      uint64_t MSKWDG2L:1;
      uint64_t MSKWDG2H:1;
      uint64_t MSKWDG3L:1;
      uint64_t MSKWDG3H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTIMR;

