iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0:1;
      uint64_t DMA1:1;
      uint64_t DMA2:1;
      uint64_t DMA3:1;
      uint64_t DMA4:1;
      uint64_t DMA5:1;
      uint64_t DMA6:1;
      uint64_t DMA7:1;
      uint64_t DMA8:1;
      uint64_t DMA9:1;
      uint64_t DMA10:1;
      uint64_t DMA11:1;
      uint64_t DMA12:1;
      uint64_t DMA13:1;
      uint64_t DMA14:1;
      uint64_t DMA15:1;
      uint64_t DMA16:1;
      uint64_t DMA17:1;
      uint64_t DMA18:1;
      uint64_t DMA19:1;
      uint64_t DMA20:1;
      uint64_t DMA21:1;
      uint64_t DMA22:1;
      uint64_t DMA23:1;
      uint64_t DMA24:1;
      uint64_t DMA25:1;
      uint64_t DMA26:1;
      uint64_t DMA27:1;
      uint64_t DMA28:1;
      uint64_t DMA29:1;
      uint64_t DMA30:1;
      uint64_t DMA31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA32:1;
      uint64_t DMA33:1;
      uint64_t DMA34:1;
      uint64_t DMA35:1;
      uint64_t DMA36:1;
      uint64_t DMA37:1;
      uint64_t DMA38:1;
      uint64_t DMA39:1;
      uint64_t DMA40:1;
      uint64_t DMA41:1;
      uint64_t DMA42:1;
      uint64_t DMA43:1;
      uint64_t DMA44:1;
      uint64_t DMA45:1;
      uint64_t DMA46:1;
      uint64_t DMA47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA64:1;
      uint64_t DMA65:1;
      uint64_t DMA66:1;
      uint64_t DMA67:1;
      uint64_t DMA68:1;
      uint64_t DMA69:1;
      uint64_t DMA70:1;
      uint64_t DMA71:1;
      uint64_t DMA72:1;
      uint64_t DMA73:1;
      uint64_t DMA74:1;
      uint64_t DMA75:1;
      uint64_t DMA76:1;
      uint64_t DMA77:1;
      uint64_t DMA78:1;
      uint64_t DMA79:1;
      uint64_t DMA80:1;
      uint64_t DMA81:1;
      uint64_t DMA82:1;
      uint64_t DMA83:1;
      uint64_t DMA84:1;
      uint64_t DMA85:1;
      uint64_t DMA86:1;
      uint64_t DMA87:1;
      uint64_t DMA88:1;
      uint64_t DMA89:1;
      uint64_t DMA90:1;
      uint64_t DMA91:1;
      uint64_t DMA92:1;
      uint64_t DMA93:1;
      uint64_t DMA94:1;
      uint64_t DMA95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR2;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:12;
      uint64_t reservedSpace0:4;
      uint64_t THRH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECONV:1;
      uint64_t PREVAL0:2;
      uint64_t PREVAL1:2;
      uint64_t PREVAL2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRES0:1;
      uint64_t PRES1:1;
      uint64_t PRES2:1;
      uint64_t PRES3:1;
      uint64_t PRES4:1;
      uint64_t PRES5:1;
      uint64_t PRES6:1;
      uint64_t PRES7:1;
      uint64_t PRES8:1;
      uint64_t PRES9:1;
      uint64_t PRES10:1;
      uint64_t PRES11:1;
      uint64_t PRES12:1;
      uint64_t PRES13:1;
      uint64_t PRES14:1;
      uint64_t PRES15:1;
      uint64_t PRES16:1;
      uint64_t PRES17:1;
      uint64_t PRES18:1;
      uint64_t PRES19:1;
      uint64_t PRES20:1;
      uint64_t PRES21:1;
      uint64_t PRES22:1;
      uint64_t PRES23:1;
      uint64_t PRES24:1;
      uint64_t PRES25:1;
      uint64_t PRES26:1;
      uint64_t PRES27:1;
      uint64_t PRES28:1;
      uint64_t PRES29:1;
      uint64_t PRES30:1;
      uint64_t PRES31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRES32:1;
      uint64_t PRES33:1;
      uint64_t PRES34:1;
      uint64_t PRES35:1;
      uint64_t PRES36:1;
      uint64_t PRES37:1;
      uint64_t PRES38:1;
      uint64_t PRES39:1;
      uint64_t PRES40:1;
      uint64_t PRES41:1;
      uint64_t PRES42:1;
      uint64_t PRES43:1;
      uint64_t PRES44:1;
      uint64_t PRES45:1;
      uint64_t PRES46:1;
      uint64_t PRES47:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRES64:1;
      uint64_t PRES65:1;
      uint64_t PRES66:1;
      uint64_t PRES67:1;
      uint64_t PRES68:1;
      uint64_t PRES69:1;
      uint64_t PRES70:1;
      uint64_t PRES71:1;
      uint64_t PRES72:1;
      uint64_t PRES73:1;
      uint64_t PRES74:1;
      uint64_t PRES75:1;
      uint64_t PRES76:1;
      uint64_t PRES77:1;
      uint64_t PRES78:1;
      uint64_t PRES79:1;
      uint64_t PRES80:1;
      uint64_t PRES81:1;
      uint64_t PRES82:1;
      uint64_t PRES83:1;
      uint64_t PRES84:1;
      uint64_t PRES85:1;
      uint64_t PRES86:1;
      uint64_t PRES87:1;
      uint64_t PRES88:1;
      uint64_t PRES89:1;
      uint64_t PRES90:1;
      uint64_t PRES91:1;
      uint64_t PRES92:1;
      uint64_t PRES93:1;
      uint64_t PRES94:1;
      uint64_t PRES95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSR2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPSAMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR2;

