iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define AIPS_AIPS_1 (*(volatile struct AIPS_AIPS_1_tag *) 0xf8000000)

struct BCTU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEN0:1;
      uint64_t IEN1:1;
      uint64_t IEN2:1;
      uint64_t IEN3:1;
      uint64_t reservedSpace0:1;
      uint64_t LIST_IEN:1;
      uint64_t reservedSpace1:1;
      uint64_t TRGEN:1;
      uint64_t reservedSpace2:8;
      uint64_t DMA0:1;
      uint64_t DMA1:1;
      uint64_t DMA2:1;
      uint64_t DMA3:1;
      uint64_t reservedSpace3:6;
      uint64_t GTRGEN:1;
      uint64_t reservedSpace4:2;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDATA0:1;
      uint64_t NDATA1:1;
      uint64_t NDATA2:1;
      uint64_t NDATA3:1;
      uint64_t DATAOVR0:1;
      uint64_t DATAOVR1:1;
      uint64_t DATAOVR2:1;
      uint64_t DATAOVR3:1;
      uint64_t LIST0_Last:1;
      uint64_t LIST1_Last:1;
      uint64_t LIST2_Last:1;
      uint64_t LIST3_Last:1;
      uint64_t reservedSpace0:3;
      uint64_t TRGF:1;
      uint64_t NDATA0_CLR:1;
      uint64_t NDATA1_CLR:1;
      uint64_t NDATA2_CLR:1;
      uint64_t NDATA3_CLR:1;
      uint64_t DATAOVR0_CLR:1;
      uint64_t DATAOVR1_CLR:1;
      uint64_t DATAOVR2_CLR:1;
      uint64_t DATAOVR3_CLR:1;
      uint64_t LIST0_Last_CLR:1;
      uint64_t LIST1_Last_CLR:1;
      uint64_t LIST2_Last_CLR:1;
      uint64_t LIST3_Last_CLR:1;
      uint64_t reservedSpace1:3;
      uint64_t TRGF_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL_VALUE_OR_LADDR:7;
      uint64_t reservedSpace0:1;
      uint64_t ADC_SEL0:1;
      uint64_t ADC_SEL1:1;
      uint64_t ADC_SEL2:1;
      uint64_t ADC_SEL3:1;
      uint64_t reservedSpace1:1;
      uint64_t TRS:1;
      uint64_t TRG_FLAG:1;
      uint64_t TRIGEN:1;
      uint64_t CCP:4;
      uint64_t reservedSpace2:11;
      uint64_t LOOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGCFG_31;

