iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res2[400];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROTEC_CODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFTRG0:1;
      uint64_t SFTRG1:1;
      uint64_t SFTRG2:1;
      uint64_t SFTRG3:1;
      uint64_t SFTRG4:1;
      uint64_t SFTRG5:1;
      uint64_t SFTRG6:1;
      uint64_t SFTRG7:1;
      uint64_t SFTRG8:1;
      uint64_t SFTRG9:1;
      uint64_t SFTRG10:1;
      uint64_t SFTRG11:1;
      uint64_t SFTRG12:1;
      uint64_t SFTRG13:1;
      uint64_t SFTRG14:1;
      uint64_t SFTRG15:1;
      uint64_t SFTRG16:1;
      uint64_t SFTRG17:1;
      uint64_t SFTRG18:1;
      uint64_t SFTRG19:1;
      uint64_t SFTRG20:1;
      uint64_t SFTRG21:1;
      uint64_t SFTRG22:1;
      uint64_t SFTRG23:1;
      uint64_t SFTRG24:1;
      uint64_t SFTRG25:1;
      uint64_t SFTRG26:1;
      uint64_t SFTRG27:1;
      uint64_t SFTRG28:1;
      uint64_t SFTRG29:1;
      uint64_t SFTRG30:1;
      uint64_t SFTRG31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFTRGR1;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:12;
      uint64_t reservedSpace0:2;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:8;
      uint64_t TRG_SRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:12;
      uint64_t reservedSpace0:2;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:8;
      uint64_t TRG_SRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:12;
      uint64_t reservedSpace0:2;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:8;
      uint64_t TRG_SRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC2DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DATA:12;
      uint64_t reservedSpace0:2;
      uint64_t LAST:1;
      uint64_t LIST:1;
      uint64_t CH:8;
      uint64_t TRG_SRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC3DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LISTSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTSTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHL_y_plus_1:7;
      uint64_t reservedSpace0:1;
      uint64_t TAG_y_plus_1:4;
      uint64_t reservedSpace1:3;
      uint64_t LAST_y_plus_1:1;
      uint64_t ADC_CH_y:7;
      uint64_t reservedSpace2:1;
      uint64_t TAG_y:4;
      uint64_t reservedSpace3:3;
      uint64_t LAST_y:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LISTCHR_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAG:4;
      uint64_t reservedSpace0:4;
      uint64_t DEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_10;

