iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define CRC_CRC_0 (*(volatile struct CRC_CRC_0_tag *) 0xfff64000)

struct CRC_CRC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV:1;
      uint64_t SWAP:1;
      uint64_t POLYG:2;
      uint64_t SWAP_BITWISE:1;
      uint64_t SWAP_BYTEWISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUTP;

};

#define CRC_CRC_1 (*(volatile struct CRC_CRC_1_tag *) 0xfbf64000)

struct DECFILTER_DECFILTER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t OBIE:1;
      uint64_t IBIE:1;
      uint64_t DSEL:1;
      uint64_t SDIE:1;
      uint64_t DEC_RATE:4;
      uint64_t reservedSpace1:1;
      uint64_t ISEL:1;
      uint64_t SAT:1;
      uint64_t IDIS:1;
      uint64_t SCAL:2;
      uint64_t reservedSpace2:1;
      uint64_t FTYPE:2;
      uint64_t reservedSpace3:1;
      uint64_t ERREN:1;
      uint64_t ODEN:1;
      uint64_t IDEN:1;
      uint64_t CASCD:2;
      uint64_t SRES:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace4:1;
      uint64_t FREN:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IVR:1;
      uint64_t OVR:1;
      uint64_t OVF:1;
      uint64_t reservedSpace0:2;
      uint64_t OBIF:1;
      uint64_t IBIF:1;
      uint64_t reservedSpace1:1;
      uint64_t ODF:1;
      uint64_t IDF:1;
      uint64_t reservedSpace2:6;
      uint64_t IVRC:1;
      uint64_t OVRC:1;
      uint64_t OVFC:1;
      uint64_t reservedSpace3:2;
      uint64_t OBIC:1;
      uint64_t IBIC:1;
      uint64_t reservedSpace4:1;
      uint64_t ODFC:1;
      uint64_t IDFC:1;
      uint64_t DEC_COUNTER:4;
      uint64_t reservedSpace5:1;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SENSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t SRQSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t SHLTSEL:2;
      uint64_t reservedSpace2:2;
      uint64_t SZROSEL:2;
      uint64_t reservedSpace3:1;
      uint64_t SISEL:1;
      uint64_t SZRO:1;
      uint64_t SRQ:1;
      uint64_t reservedSpace4:10;
      uint64_t SCSAT:1;
      uint64_t SSAT:1;
      uint64_t SSIG:1;
      uint64_t SDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MXCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SVR:1;
      uint64_t SCOVF:1;
      uint64_t SSOVF:1;
      uint64_t reservedSpace0:1;
      uint64_t SCE:1;
      uint64_t SSE:1;
      uint64_t reservedSpace1:2;
      uint64_t SDF:1;
      uint64_t reservedSpace2:7;
      uint64_t SVRC:1;
      uint64_t SCOVFC:1;
      uint64_t SSOVFC:1;
      uint64_t reservedSpace3:1;
      uint64_t SCEC:1;
      uint64_t SSEC:1;
      uint64_t reservedSpace4:2;
      uint64_t SDFC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MXSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPBUF:16;
      uint64_t FLUSH:1;
      uint64_t PREFILL:1;
      uint64_t reservedSpace0:6;
      uint64_t INTAG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTBUF:16;
      uint64_t OUTTAG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OB;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEFn:24;
      uint64_t COEFnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF8;

  uint8_t res1[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPn:24;
      uint64_t TAPnSIGNR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP7;

