iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define DMAMUX_DMAMUX_3 (*(volatile struct DMAMUX_DMAMUX_3_tag *) 0xfbfc0000)

struct DTS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTS_EN:1;
      uint64_t DTS_EN_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEMAPHORE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_B:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEMAPHORE_B;

};

#define DTS_1 (*(volatile struct DTS_1_tag *) 0xfff38000)

struct EIM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t EICH0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHEN;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD_WORD00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD_WORD10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD_WORD20;

};

#define EIM_1 (*(volatile struct EIM_1_tag *) 0xfc07c000)

struct eMIOS_eMIOS0_eMIOS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t GPRE:8;
      uint64_t SRV:4;
      uint64_t reservedSpace1:6;
      uint64_t GPREN:1;
      uint64_t ETB:1;
      uint64_t GTBE:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F23_F0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OU23_OU0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS23_CHDIS0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UCDIS;

};

#define eMIOS_eMIOS0_eMIOS_0 (*(volatile struct eMIOS_eMIOS0_eMIOS_0_tag *) 0xffe64000)

struct eMIOS_eMIOS0_eMIOS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C28;

};

#define eMIOS_eMIOS0_eMIOS_1 (*(volatile struct eMIOS_eMIOS0_eMIOS_1_tag *) 0xffe64140)

struct eMIOS_eMIOS0_eMIOS_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C29;

