iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define eMIOS_eMIOS1_eMIOS_1 (*(volatile struct eMIOS_eMIOS1_eMIOS_1_tag *) 0xfbe64140)

struct eMIOS_eMIOS1_eMIOS_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C29;

};

#define eMIOS_eMIOS1_eMIOS_2 (*(volatile struct eMIOS_eMIOS1_eMIOS_2_tag *) 0xfbe64160)

struct eMIOS_eMIOS1_eMIOS_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C210;

};

#define eMIOS_eMIOS1_eMIOS_3 (*(volatile struct eMIOS_eMIOS1_eMIOS_3_tag *) 0xfbe64180)

struct eMIOS_eMIOS1_eMIOS_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C211;

};

#define eMIOS_eMIOS1_eMIOS_4 (*(volatile struct eMIOS_eMIOS1_eMIOS_4_tag *) 0xfbe641a0)

struct eMIOS_eMIOS1_eMIOS_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C212;

