iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define eMIOS_eMIOS1_eMIOS_9 (*(volatile struct eMIOS_eMIOS1_eMIOS_9_tag *) 0xfbe64240)

struct eMIOS_eMIOS1_eMIOS_10_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C217;

};

#define eMIOS_eMIOS1_eMIOS_10 (*(volatile struct eMIOS_eMIOS1_eMIOS_10_tag *) 0xfbe64260)

struct eMIOS_eMIOS1_eMIOS_11_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C218;

};

#define eMIOS_eMIOS1_eMIOS_11 (*(volatile struct eMIOS_eMIOS1_eMIOS_11_tag *) 0xfbe64280)

struct eMIOS_eMIOS1_eMIOS_12_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C219;

};

#define eMIOS_eMIOS1_eMIOS_12 (*(volatile struct eMIOS_eMIOS1_eMIOS_12_tag *) 0xfbe642a0)

struct eMIOS_eMIOS1_eMIOS_13_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t A:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) B20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:7;
      uint64_t EDPOL:1;
      uint64_t EDSEL:1;
      uint64_t BSL:2;
      uint64_t reservedSpace0:1;
      uint64_t FORCMB:1;
      uint64_t FORCMA:1;
      uint64_t reservedSpace1:3;
      uint64_t FEN:1;
      uint64_t FCK:1;
      uint64_t IF:4;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t UCPREN:1;
      uint64_t UCPRE:2;
      uint64_t ODISSL:2;
      uint64_t ODIS:1;
      uint64_t FREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG:1;
      uint64_t UCOUT:1;
      uint64_t UCIN:1;
      uint64_t reservedSpace0:12;
      uint64_t OVFL:1;
      uint64_t reservedSpace1:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTA20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t UCPRECLK:1;
      uint64_t reservedSpace1:1;
      uint64_t UCEXTPRE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C220;

