iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG11;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG12;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG13;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG14;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG15;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG16;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG17;

