iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG18;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG19;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG110;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG111;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG112;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG113;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG114;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG115;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG116;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG117;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG118;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG119;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG120;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG121;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG122;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG123;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG124;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG125;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG126;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG127;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG128;

