iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res58[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG227;

  uint8_t res59[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG228;

  uint8_t res60[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG229;

  uint8_t res61[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG230;

  uint8_t res62[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPBA:11;
      uint64_t reservedSpace0:3;
      uint64_t OPOL:1;
      uint64_t ODIS:1;
      uint64_t CFS:5;
      uint64_t reservedSpace1:3;
      uint64_t ETCS:1;
      uint64_t ETPD:1;
      uint64_t SSMAE:1;
      uint64_t T4DIS:1;
      uint64_t CPR:2;
      uint64_t DTRE:1;
      uint64_t CIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR_ENG231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FM:2;
      uint64_t reservedSpace0:12;
      uint64_t OPS:1;
      uint64_t IPS:1;
      uint64_t reservedSpace1:6;
      uint64_t DTROS:1;
      uint64_t DTRS:1;
      uint64_t reservedSpace2:6;
      uint64_t CIOS:1;
      uint64_t CIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR_ENG231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSRR_ENG231;

};

#define eTPU_eTPU_CCCR_1 (*(volatile struct eTPU_eTPU_CCCR_1_tag *) 0xffcc0800)

struct eTPU_eTPU_ER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDCNT:16;
      uint64_t reservedSpace0:12;
      uint64_t WMO:1;
      uint64_t reservedSpace1:1;
      uint64_t WDM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTR_ENG1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICLR:1;
      uint64_t IDLE_CNT:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDLER_ENG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDCNT:16;
      uint64_t reservedSpace0:12;
      uint64_t WMO:1;
      uint64_t reservedSpace1:1;
      uint64_t WDM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTR_ENG2;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICLR:1;
      uint64_t IDLE_CNT:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDLER_ENG2;

};

#define eTPU_eTPU_ER_1 (*(volatile struct eTPU_eTPU_ER_1_tag *) 0xffcc00c0)

