iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define eTPU_eTPU_SCR_1 (*(volatile struct eTPU_eTPU_SCR_1_tag *) 0xffcc0000)

struct eTPU_eTPU_SSIR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCHAN:5;
      uint64_t reservedSpace0:1;
      uint64_t LENG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETPUSSSIR9;

};

#define eTPU_eTPU_SSIR_1 (*(volatile struct eTPU_eTPU_SSIR_1_tag *) 0xffcc1800)

struct eTPU_eTPU_TBR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR1P:8;
      uint64_t reservedSpace0:5;
      uint64_t TCR1CS:1;
      uint64_t TCR1CTL:2;
      uint64_t TCR2P:6;
      uint64_t reservedSpace1:2;
      uint64_t ATGC:1;
      uint64_t AM:2;
      uint64_t TCRCF:2;
      uint64_t TCR2CTL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCR_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TB1R_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TB2R_ENG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRV2:4;
      uint64_t reservedSpace0:4;
      uint64_t SERVER_ID2:4;
      uint64_t reservedSpace1:2;
      uint64_t RSC2:1;
      uint64_t REN2:1;
      uint64_t SRV1:4;
      uint64_t reservedSpace2:4;
      uint64_t SERVER_ID1:4;
      uint64_t reservedSpace3:2;
      uint64_t RSC1:1;
      uint64_t REN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAC_ENG1;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR1P:8;
      uint64_t reservedSpace0:5;
      uint64_t TCR1CS:1;
      uint64_t TCR1CTL:2;
      uint64_t TCR2P:6;
      uint64_t reservedSpace1:2;
      uint64_t ATGC:1;
      uint64_t AM:2;
      uint64_t TCRCF:2;
      uint64_t TCR2CTL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCR_ENG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TB1R_ENG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TB2R_ENG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRV2:4;
      uint64_t reservedSpace0:4;
      uint64_t SERVER_ID2:4;
      uint64_t reservedSpace1:2;
      uint64_t RSC2:1;
      uint64_t REN2:1;
      uint64_t SRV1:4;
      uint64_t reservedSpace2:4;
      uint64_t SERVER_ID1:4;
      uint64_t reservedSpace3:2;
      uint64_t RSC1:1;
      uint64_t REN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAC_ENG2;

};

#define eTPU_eTPU_TBR_1 (*(volatile struct eTPU_eTPU_TBR_1_tag *) 0xffcc0040)

struct FCCU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPR:5;
      uint64_t reservedSpace0:1;
      uint64_t OPS:2;
      uint64_t reservedSpace1:1;
      uint64_t DEBUG:1;
      uint64_t reservedSpace2:19;
      uint64_t FILTER_WIDTH:2;
      uint64_t FILTER_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRLK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FOP:6;
      uint64_t FOM:3;
      uint64_t PS:1;
      uint64_t SM:1;
      uint64_t reservedSpace0:4;
      uint64_t FOPE:1;
      uint64_t reservedSpace1:4;
      uint64_t RCCE0:1;
      uint64_t RCCE1:1;
      uint64_t FCCU_SET_CLEAR:2;
      uint64_t FCCU_SET_AFTER_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res0[16];

  uint32_t NCF_CFG0;
  uint32_t NCF_CFG1;
  uint32_t NCF_CFG2;
  uint8_t res1[36];

  uint32_t NCFS_CFG0;
  uint32_t NCFS_CFG1;
  uint32_t NCFS_CFG2;
  uint32_t NCFS_CFG3;
  uint32_t NCFS_CFG4;
  uint32_t NCFS_CFG5;
  uint8_t res2[28];

  uint32_t NCF_S0;
  uint32_t NCF_S1;
  uint32_t NCF_S2;
  uint8_t res3[8];

  uint32_t NCF_E0;
  uint32_t NCF_E1;
  uint32_t NCF_E2;
  uint8_t res4[4];

  uint32_t NCF_TOE0;
  uint32_t NCF_TOE1;
  uint32_t NCF_TOE2;
  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG_TO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUT0:1;
      uint64_t EOUT1:1;
      uint64_t reservedSpace0:2;
      uint64_t EIN0:1;
      uint64_t EIN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EINOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:3;
      uint64_t ESTAT:1;
      uint64_t PhysicErrorPin:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NAFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) N2AF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFFS:8;
      uint64_t AF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) A2FF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFFS:8;
      uint64_t NF_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) N2FF_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAFS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F2A_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCCS0:1;
      uint64_t RCCS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCFS;

