iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_TO_STAT:1;
      uint64_t ALRM_STAT:1;
      uint64_t NMI_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG_TO_IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTMR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCS0:4;
      uint64_t reservedSpace0:2;
      uint64_t FS0:1;
      uint64_t VL0:1;
      uint64_t MCS1:4;
      uint64_t reservedSpace1:2;
      uint64_t FS1:1;
      uint64_t VL1:1;
      uint64_t MCS2:4;
      uint64_t reservedSpace2:2;
      uint64_t FS2:1;
      uint64_t VL2:1;
      uint64_t MCS3:4;
      uint64_t reservedSpace3:2;
      uint64_t FS3:1;
      uint64_t VL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRANSKEY:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRANS_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERMNTKEY:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERMNT_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELTA_T:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DELTA_T;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ_ALARM_EN2;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_EN2;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOUTENx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EOUT_SIG_EN2;

};

#define FCCU_1 (*(volatile struct FCCU_1_tag *) 0xfbf58000)

struct FEC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:19;
      uint64_t UN:1;
      uint64_t RL:1;
      uint64_t LC:1;
      uint64_t EBERR:1;
      uint64_t MII:1;
      uint64_t RXB:1;
      uint64_t RXF:1;
      uint64_t TXB:1;
      uint64_t TXF:1;
      uint64_t GRA:1;
      uint64_t BABT:1;
      uint64_t BABR:1;
      uint64_t HBERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:19;
      uint64_t UN:1;
      uint64_t RL:1;
      uint64_t LC:1;
      uint64_t EBERR:1;
      uint64_t MII:1;
      uint64_t RXB:1;
      uint64_t RXF:1;
      uint64_t TXB:1;
      uint64_t TXF:1;
      uint64_t GRA:1;
      uint64_t BABT:1;
      uint64_t BABR:1;
      uint64_t HBERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIMR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RDAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t TDAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t ETHER_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t TA:2;
      uint64_t RA:5;
      uint64_t PA:5;
      uint64_t OP:2;
      uint64_t ST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MII_SPEED:6;
      uint64_t DIS_PRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t MIB_IDLE:1;
      uint64_t MIB_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIBC;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOP:1;
      uint64_t DRT:1;
      uint64_t MII_MODE:1;
      uint64_t PROM:1;
      uint64_t BC_REJ:1;
      uint64_t FCE:1;
      uint64_t reservedSpace0:2;
      uint64_t RMII_MODE:1;
      uint64_t RMII_10T:1;
      uint64_t RMII_LOOP:1;
      uint64_t RMII_ECHO:1;
      uint64_t reservedSpace1:4;
      uint64_t MAX_FL:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GTS:1;
      uint64_t HBC:1;
      uint64_t FDEN:1;
      uint64_t TFC_PAUSE:1;
      uint64_t RFC_PAUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  uint8_t res6[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TYPE:16;
      uint64_t PADDR2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSE_DUR:16;
      uint64_t OPCODE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPD;

  uint8_t res7[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GALR;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFWR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFWR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t R_BOUND:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t R_FSTART:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRSR;

  uint8_t res10[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t R_DES_START:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t X_DES_START:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t R_BUF_SIZE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMRBR;

  uint8_t res11[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_DROP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_DROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_PACKETS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_BC_PKT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_BC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_MC_PKT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_MC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_CRC_ALIGN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_CRC_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_UNDERSIZE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_UNDERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_OVERSIZE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_OVERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_FRAG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_FRAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_JAB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_JAB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_COL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_COL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P65TO127:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P65TO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P128TO255:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P128TO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P256TO511:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P256TO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P512TO1023:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P512TO1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P1024TO2047:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P1024TO2047;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_P_GTE2048:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_P_GTE2048;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_T_OCTETS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_T_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_DROP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_DROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_FRAME_OK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_FRAME_OK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_1COL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_1COL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_MCOL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_MCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_DEF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_DEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_LCOL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_LCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_EXCOL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_EXCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_MACERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_MACERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_CSERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_CSERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_SQE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_SQE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_FDXFC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_FDXFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_T_OCTETS_OK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_T_OCTETS_OK;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_DROP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_DROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_PACKETS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_BC_PKT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_BC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_MC_PKT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_MC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_CRC_ALIGN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_CRC_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_UNDERSIZE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_UNDERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_OVERSIZE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_OVERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_FRAG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_FRAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_JAB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_JAB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_RESVD_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_RESVD_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P65TO127:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P65TO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P128TO255:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P128TO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P256TO511:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P256TO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P512TO1023:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P512TO1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P1024TO2047:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P1024TO2047;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_P_GTE2048:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_P_GTE2048;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMON_R_OCTETS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMON_R_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_DROP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_DROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_FRAME_OK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_FRAME_OK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_ALIGN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_MACERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_MACERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_FDXFC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_FDXFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEEE_R_OCTETS_OK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEEE_R_OCTETS_OK;

