iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define FEC_1 (*(volatile struct FEC_1_tag *) 0xfc0b0004)

struct IGF_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR0;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPRE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESR0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR0;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR1;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR1;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR2;

  uint8_t res5[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR2;

  uint8_t res6[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR3;

  uint8_t res7[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR3;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR4;

  uint8_t res9[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR4;

  uint8_t res10[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR5;

  uint8_t res11[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR5;

