iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res12[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR6;

  uint8_t res13[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR6;

  uint8_t res14[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR7;

  uint8_t res15[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR7;

  uint8_t res16[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR8;

  uint8_t res17[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR8;

  uint8_t res18[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR9;

  uint8_t res19[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR9;

  uint8_t res20[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR10;

  uint8_t res21[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR10;

  uint8_t res22[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFM:2;
      uint64_t reservedSpace0:1;
      uint64_t FFM:2;
      uint64_t reservedSpace1:1;
      uint64_t FGEN:1;
      uint64_t POL:1;
      uint64_t PSSEL:1;
      uint64_t IMM:1;
      uint64_t reservedSpace2:16;
      uint64_t FOL:1;
      uint64_t FOH:1;
      uint64_t FBP:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLO:1;
      uint64_t FLI:1;
      uint64_t FNDET:1;
      uint64_t RNDET:1;
      uint64_t FEDGE:1;
      uint64_t WEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR11;

  uint8_t res23[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTHR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTHR11;

