iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR546;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR547;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR548;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR549;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR550;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR551;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR552;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR553;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR554;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR555;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR556;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR557;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR558;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR559;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR560;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR561;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR562;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR563;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR564;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR565;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR566;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR567;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR568;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR569;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR570;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR571;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR572;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR573;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR574;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR575;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR576;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR577;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR578;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR579;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR580;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR581;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR582;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR583;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR584;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR585;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR586;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR587;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR588;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR589;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR590;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR591;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR592;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR593;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR594;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR595;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR596;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR597;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR598;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR599;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR600;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR601;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR602;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR603;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR604;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR605;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR606;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR607;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR608;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR609;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR610;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR611;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR612;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR613;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR614;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR615;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR616;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR617;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR618;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR619;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR620;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR621;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR622;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR623;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR624;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR625;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR626;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR627;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR628;

