iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR629;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR630;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR631;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR632;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR633;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR634;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR635;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR636;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR637;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR638;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR639;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR640;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR641;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR642;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR643;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR644;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR645;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR646;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR647;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR648;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR649;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR650;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR651;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR652;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR653;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR654;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR655;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR656;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR657;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR658;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR659;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR660;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR661;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR662;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR663;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR664;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR665;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR666;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR667;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR668;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR669;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR670;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR671;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR672;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR673;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR674;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR675;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR676;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR677;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR678;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR679;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR680;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR681;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR682;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR683;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR684;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR685;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR686;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR687;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR688;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR689;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR690;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR691;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR692;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR693;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR694;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR695;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR696;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR697;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR698;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR699;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR700;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR701;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR702;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR703;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR704;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR705;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR706;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR707;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR708;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR709;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR710;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR711;

