iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR712;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR713;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR714;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR715;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR716;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR717;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR718;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR719;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR720;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR721;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR722;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR723;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR724;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR725;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR726;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR727;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR728;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR729;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR730;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR731;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR732;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR733;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR734;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR735;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR736;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR737;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR738;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR739;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR740;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR741;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR742;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR743;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR744;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR745;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR746;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR747;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR748;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR749;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR750;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR751;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR752;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR753;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR754;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR755;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR756;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR757;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR758;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR759;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR760;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR761;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR762;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR763;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR764;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR765;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR766;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR767;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR768;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR769;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR770;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR771;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR772;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR773;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR774;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR775;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR776;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR777;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR778;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR779;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR780;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR781;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR782;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR783;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR784;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR785;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR786;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR787;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR788;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR789;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR790;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR791;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR792;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR793;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRIN:6;
      uint64_t reservedSpace0:2;
      uint64_t SWTN:1;
      uint64_t reservedSpace1:5;
      uint64_t PRC_SELN1:1;
      uint64_t PRC_SELN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSR794;

