iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDO_LOW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t TDO_HIGH:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR1;

};

#define JTAGM_1 (*(volatile struct JTAGM_1_tag *) 0xfff48000)

struct LFAST_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAEN:1;
      uint64_t DRFRST:1;
      uint64_t reservedSpace0:1;
      uint64_t CTSEN:1;
      uint64_t TXARBD:1;
      uint64_t reservedSpace1:8;
      uint64_t TXEN:1;
      uint64_t RXEN:1;
      uint64_t DRFEN:1;
      uint64_t LSSEL:1;
      uint64_t reservedSpace2:7;
      uint64_t IPGDBG:1;
      uint64_t reservedSpace3:6;
      uint64_t MSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:1;
      uint64_t reservedSpace0:7;
      uint64_t RDR:1;
      uint64_t reservedSpace1:7;
      uint64_t DRMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHSSEL:1;
      uint64_t CORRTH:3;
      uint64_t reservedSpace0:20;
      uint64_t SMPSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPFRMTH:16;
      uint64_t LPMOD:3;
      uint64_t reservedSpace0:5;
      uint64_t LPON:1;
      uint64_t CLKTST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPFMCNT:16;
      uint64_t LPCNTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LWKCNT:4;
      uint64_t reservedSpace0:4;
      uint64_t HWKCNT:8;
      uint64_t LSCNT:4;
      uint64_t reservedSpace1:4;
      uint64_t HSCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICLCPLD:8;
      uint64_t reservedSpace0:8;
      uint64_t SNDICLC:1;
      uint64_t ICLCSEQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PNGPYLD:8;
      uint64_t reservedSpace0:7;
      uint64_t PNGAUTO:1;
      uint64_t PNGREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PICR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCTSMN:6;
      uint64_t reservedSpace0:10;
      uint64_t RCTSMX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDTIE:1;
      uint64_t TXICLCIE:1;
      uint64_t TXUNSIE:1;
      uint64_t reservedSpace0:1;
      uint64_t TXPNGIE:1;
      uint64_t reservedSpace1:11;
      uint64_t TXOVIE:1;
      uint64_t TXIIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXUNSIE:1;
      uint64_t RXDIE:1;
      uint64_t RXCTSIE:1;
      uint64_t reservedSpace1:12;
      uint64_t RXLCEIE:1;
      uint64_t RXICIE:1;
      uint64_t RXSZIE:1;
      uint64_t RXOFIE:1;
      uint64_t RXUFIE:1;
      uint64_t RXMXIE:1;
      uint64_t RXMNIE:1;
      uint64_t RXUOIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICPONIE:1;
      uint64_t ICPOFIE:1;
      uint64_t ICTSIE:1;
      uint64_t ICTFIE:1;
      uint64_t ICRSIE:1;
      uint64_t ICRFIE:1;
      uint64_t ICTEIE:1;
      uint64_t ICTDIE:1;
      uint64_t ICCTIE:1;
      uint64_t ICLPIE:1;
      uint64_t ICTOIE:1;
      uint64_t ICPRIE:1;
      uint64_t ICPSIE:1;
      uint64_t ICPFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREDIV:2;
      uint64_t FBDIV:6;
      uint64_t FDIVEN:1;
      uint64_t PLCKCW:2;
      uint64_t reservedSpace0:4;
      uint64_t REFINV:1;
      uint64_t SWPON:1;
      uint64_t SWPOFF:1;
      uint64_t reservedSpace1:11;
      uint64_t IPTMOD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVCKP:1;
      uint64_t LVCKSS:1;
      uint64_t LVTXOP:1;
      uint64_t LVRXOP_BR:1;
      uint64_t reservedSpace0:1;
      uint64_t LVRXOP_TR:1;
      uint64_t reservedSpace1:5;
      uint64_t LVLPEN:1;
      uint64_t LVRFEN:1;
      uint64_t TXCMUX:1;
      uint64_t LVTXOE:1;
      uint64_t LVRXOFF:1;
      uint64_t SWONLR:1;
      uint64_t SWOFFLR:1;
      uint64_t SWONLD:1;
      uint64_t SWOFFLD:1;
      uint64_t SWSLPLR:1;
      uint64_t SWWKLR:1;
      uint64_t SWSLPLD:1;
      uint64_t SWWKLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNSHDR:7;
      uint64_t reservedSpace0:9;
      uint64_t USNDRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNTXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UNSTDR8;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPCSDV:1;
      uint64_t LPCHDV:1;
      uint64_t LPCPDV:1;
      uint64_t LPFPDV:1;
      uint64_t LPTXDN:1;
      uint64_t reservedSpace0:11;
      uint64_t DRSM:1;
      uint64_t LDSM:1;
      uint64_t LRMD:1;
      uint64_t reservedSpace1:12;
      uint64_t DUALMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPNGD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PISR;

