iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res30[18];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RUN_CFG:3;
      uint64_t LP_CFG:3;
      uint64_t DBG_F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCTL251;

  uint8_t res31[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_CORE1:1;
      uint64_t S_CORE0:1;
      uint64_t S_COREC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCTL0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCTL1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCTL2;

  uint8_t res32[22];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMC:1;
      uint64_t reservedSpace0:1;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMC:1;
      uint64_t reservedSpace0:1;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CADDR2;

};

#define MC_ME_1 (*(volatile struct MC_ME_1_tag *) 0xfffb8000)

struct MC_PCU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT;

};

#define MC_PCU_1 (*(volatile struct MC_PCU_1_tag *) 0xfffa0080)

struct MC_RGM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_POR:1;
      uint64_t F_PORST:1;
      uint64_t reservedSpace0:1;
      uint64_t F_SOFT_DEST:1;
      uint64_t F_FFRR:1;
      uint64_t F_SUF:1;
      uint64_t F_SSR:1;
      uint64_t reservedSpace1:1;
      uint64_t F_EDR:1;
      uint64_t F_FIF:1;
      uint64_t F_JTAG:1;
      uint64_t reservedSpace2:12;
      uint64_t F_TSR:1;
      uint64_t F_VOR:1;
      uint64_t F_PMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t D_PORST:1;
      uint64_t reservedSpace1:1;
      uint64_t D_SOFT_DEST:1;
      uint64_t D_FFRR:1;
      uint64_t D_SUF:1;
      uint64_t reservedSpace2:2;
      uint64_t D_EDR:1;
      uint64_t D_FIF:1;
      uint64_t D_JTAG:1;
      uint64_t reservedSpace3:12;
      uint64_t D_TSR:1;
      uint64_t D_VOR:1;
      uint64_t D_PMC_STF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERD;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AR_PORST:1;
      uint64_t reservedSpace1:21;
      uint64_t AR_TSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEAR;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BE_POR:1;
      uint64_t BE_PORST:1;
      uint64_t reservedSpace0:1;
      uint64_t BE_SOFT_DEST:1;
      uint64_t BE_FFRR:1;
      uint64_t BE_SUF:1;
      uint64_t reservedSpace1:2;
      uint64_t BE_EDR:1;
      uint64_t BE_FIF:1;
      uint64_t BE_JTAG:1;
      uint64_t reservedSpace2:12;
      uint64_t BE_TSR:1;
      uint64_t BE_VOR:1;
      uint64_t BE_PMC_STF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBRE;

  uint8_t res3[716];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_EXR:1;
      uint64_t reservedSpace0:1;
      uint64_t F_ST_DONE:1;
      uint64_t F_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t F_FCCU_HARD:1;
      uint64_t F_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t F_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t F_TSR_FUNC:1;
      uint64_t F_VOR_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FES;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t D_ST_DONE:1;
      uint64_t D_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t D_FCCU_HARD:1;
      uint64_t D_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t D_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t D_TSR_FUNC:1;
      uint64_t D_VOR_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FERD;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:23;
      uint64_t AR_TSR_FUNC:1;
      uint64_t AR_VOR_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEAR;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BE_RESET:1;
      uint64_t reservedSpace0:1;
      uint64_t BE_ST_DONE:1;
      uint64_t BE_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t BE_FCCU_HARD:1;
      uint64_t BE_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t BE_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t BE_TSR_FUNC:1;
      uint64_t BE_VOR_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBRE;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS_EXR:1;
      uint64_t reservedSpace0:1;
      uint64_t SS_ST_DONE:1;
      uint64_t SS_SOFT_FUNC:1;
      uint64_t reservedSpace1:1;
      uint64_t SS_FCCU_HARD:1;
      uint64_t SS_FCCU_SOFT:1;
      uint64_t reservedSpace2:3;
      uint64_t SS_JTAG_FUNC:1;
      uint64_t reservedSpace3:12;
      uint64_t SS_TSR_FUNC:1;
      uint64_t SS_VOR_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FESS;

  uint8_t res8[704];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FRET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FRET;

