iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define MEMU_1 (*(volatile struct MEMU_1_tag *) 0xfff50000)

struct PASS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIFE:3;
      uint64_t reservedSpace0:27;
      uint64_t JUN:1;
      uint64_t CNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSEL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTAT;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PW32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIN7;

  uint8_t res3[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t ATSL:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_256LCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK2_PG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t U_256LCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t reservedSpace0:5;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t ATSL:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_256LCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK2_PG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t U_256LCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t reservedSpace0:5;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t ATSL:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_256LCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK2_PG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t U_256LCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t reservedSpace0:5;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDLOCK:16;
      uint64_t LOWLOCK:14;
      uint64_t ATSL:1;
      uint64_t TSLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK0_PG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGHLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK1_PG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_256LCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK2_PG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t U_256LCK:16;
      uint64_t RL0:1;
      uint64_t RL1:1;
      uint64_t RL2:1;
      uint64_t reservedSpace0:5;
      uint64_t MSTR:4;
      uint64_t reservedSpace1:1;
      uint64_t MO:1;
      uint64_t DBL:1;
      uint64_t PGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK3_PG3;

};

#define PASS_1 (*(volatile struct PASS_1_tag *) 0xffff4000)

struct PCM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FXSBE:8;
      uint64_t RBEN:1;
      uint64_t WBEN:1;
      uint64_t ACCERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBOMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BWE_M3:1;
      uint64_t BRE_M3:1;
      uint64_t PRE_M3:1;
      uint64_t reservedSpace0:5;
      uint64_t BWE_S0:1;
      uint64_t BRE_S0:1;
      uint64_t PRE_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IAHB_BE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BWE_FEC:1;
      uint64_t BRE_FEC:1;
      uint64_t PRE_FEC:1;
      uint64_t reservedSpace0:13;
      uint64_t BWE_SIPI:1;
      uint64_t BRE_SIPI:1;
      uint64_t PRE_SIPI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IAHB_BE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPS_CGM_PFLASH:1;
      uint64_t reservedSpace0:3;
      uint64_t IPS_CGM_PRAM:1;
      uint64_t reservedSpace1:3;
      uint64_t IPS_CGM_AXBS0:1;
      uint64_t reservedSpace2:3;
      uint64_t IPS_CGM_MPU0:1;
      uint64_t reservedSpace3:3;
      uint64_t IPS_CGM_INTC:1;
      uint64_t reservedSpace4:3;
      uint64_t IPS_CGM_AXBS1:1;
      uint64_t reservedSpace5:3;
      uint64_t IPS_CGM_MPU1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPS_CGM_EN0;

