iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define PCM_1 (*(volatile struct PCM_1_tag *) 0xfc028000)

struct PFLASH_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_BFEN:1;
      uint64_t P0_PFLIM:2;
      uint64_t reservedSpace0:1;
      uint64_t P0_IPFEN:1;
      uint64_t reservedSpace1:1;
      uint64_t P0_DPFEN:1;
      uint64_t reservedSpace2:1;
      uint64_t RWSC:5;
      uint64_t APC:3;
      uint64_t P0_M0PFE:1;
      uint64_t P0_M1PFE:1;
      uint64_t P0_M2PFE:1;
      uint64_t P0_M3PFE:1;
      uint64_t P0_M4PFE:1;
      uint64_t P0_M5PFE:1;
      uint64_t P0_M6PFE:1;
      uint64_t P0_M7PFE:1;
      uint64_t P0_M8PFE:1;
      uint64_t P0_M9PFE:1;
      uint64_t P0_M10PFE:1;
      uint64_t P0_M11PFE:1;
      uint64_t P0_M12PFE:1;
      uint64_t P0_M13PFE:1;
      uint64_t P0_M14PFE:1;
      uint64_t P0_M15PFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_BFEN:1;
      uint64_t P1_PFLIM:2;
      uint64_t reservedSpace0:1;
      uint64_t P1_IPFEN:1;
      uint64_t reservedSpace1:1;
      uint64_t P1_DPFEN:1;
      uint64_t reservedSpace2:9;
      uint64_t P1_M0PFE:1;
      uint64_t P1_M1PFE:1;
      uint64_t P1_M2PFE:1;
      uint64_t P1_M3PFE:1;
      uint64_t P1_M4PFE:1;
      uint64_t P1_M5PFE:1;
      uint64_t P1_M6PFE:1;
      uint64_t P1_M7PFE:1;
      uint64_t P1_M8PFE:1;
      uint64_t P1_M9PFE:1;
      uint64_t P1_M10PFE:1;
      uint64_t P1_M11PFE:1;
      uint64_t P1_M12PFE:1;
      uint64_t P1_M13PFE:1;
      uint64_t P1_M14PFE:1;
      uint64_t P1_M15PFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DERR_SUP:1;
      uint64_t reservedSpace0:13;
      uint64_t ARBM:2;
      uint64_t BAF_DIS:1;
      uint64_t reservedSpace1:3;
      uint64_t BDRM:1;
      uint64_t reservedSpace2:7;
      uint64_t P1_WCFG:2;
      uint64_t P0_WCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15AP:2;
      uint64_t M14AP:2;
      uint64_t M13AP:2;
      uint64_t M12AP:2;
      uint64_t M11AP:2;
      uint64_t M10AP:2;
      uint64_t M9AP:2;
      uint64_t M8AP:2;
      uint64_t M7AP:2;
      uint64_t M6AP:2;
      uint64_t M5AP:2;
      uint64_t M4AP:2;
      uint64_t M3AP:2;
      uint64_t M2AP:2;
      uint64_t M1AP:2;
      uint64_t M0AP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRMEN:1;
      uint64_t reservedSpace0:3;
      uint64_t IRMEN:1;
      uint64_t reservedSpace1:3;
      uint64_t SAFE_CAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRD31EN:1;
      uint64_t CRD30EN:1;
      uint64_t CRD29EN:1;
      uint64_t CRD28EN:1;
      uint64_t CRD27EN:1;
      uint64_t CRD26EN:1;
      uint64_t CRD25EN:1;
      uint64_t CRD24EN:1;
      uint64_t CRD23EN:1;
      uint64_t CRD22EN:1;
      uint64_t CRD21EN:1;
      uint64_t CRD20EN:1;
      uint64_t CRD19EN:1;
      uint64_t CRD18EN:1;
      uint64_t CRD17EN:1;
      uint64_t CRD16EN:1;
      uint64_t CRD15EN:1;
      uint64_t CRD14EN:1;
      uint64_t CRD13EN:1;
      uint64_t CRD12EN:1;
      uint64_t CRD11EN:1;
      uint64_t CRD10EN:1;
      uint64_t CRD9EN:1;
      uint64_t CRD8EN:1;
      uint64_t CRD7EN:1;
      uint64_t CRD6EN:1;
      uint64_t CRD5EN:1;
      uint64_t CRD4EN:1;
      uint64_t CRD3EN:1;
      uint64_t CRD2EN:1;
      uint64_t CRD1EN:1;
      uint64_t CRD0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRDE;

  uint8_t res0[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word20;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word21;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t PSTARTADDR:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRDSize:5;
      uint64_t reservedSpace0:11;
      uint64_t M15EN:1;
      uint64_t M14EN:1;
      uint64_t M13EN:1;
      uint64_t M12EN:1;
      uint64_t M11EN:1;
      uint64_t M10EN:1;
      uint64_t M9EN:1;
      uint64_t M8EN:1;
      uint64_t M7EN:1;
      uint64_t M6EN:1;
      uint64_t M5EN:1;
      uint64_t M4EN:1;
      uint64_t M3EN:1;
      uint64_t M2EN:1;
      uint64_t M1EN:1;
      uint64_t M0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCRD_Word22;

