iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define PIT_PIT_1 (*(volatile struct PIT_PIT_1_tag *) 0xfff80000)

struct PLLDIG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LOLIE:1;
      uint64_t reservedSpace1:3;
      uint64_t EXPDIE:1;
      uint64_t CLKCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOLF:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:7;
      uint64_t reservedSpace0:5;
      uint64_t PREDIV:3;
      uint64_t reservedSpace1:1;
      uint64_t RFDPHI:6;
      uint64_t reservedSpace2:5;
      uint64_t RFDPHI1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL0DV;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t LOLIE:1;
      uint64_t reservedSpace1:3;
      uint64_t EXPDIE:1;
      uint64_t CLKCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOLF:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:7;
      uint64_t reservedSpace0:9;
      uint64_t RFDPHI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1DV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INCSTP:15;
      uint64_t reservedSpace0:1;
      uint64_t MODPRD:13;
      uint64_t MODSEL:1;
      uint64_t MODEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1FM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRCDIV:12;
      uint64_t reservedSpace0:18;
      uint64_t FDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL1FD;

};

#define PLLDIG_1 (*(volatile struct PLLDIG_1_tag *) 0xfffb0100)

struct PMC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS0_0IE:1;
      uint64_t TS0_2IE:1;
      uint64_t reservedSpace0:1;
      uint64_t TS1_0IE:1;
      uint64_t TS1_2IE:1;
      uint64_t reservedSpace1:26;
      uint64_t TS_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TS_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP0_0:1;
      uint64_t TEMP0_2:1;
      uint64_t reservedSpace0:1;
      uint64_t TEMP1_0:1;
      uint64_t TEMP1_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR_TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP0_0:1;
      uint64_t TEMP0_2:1;
      uint64_t reservedSpace0:1;
      uint64_t TEMP1_0:1;
      uint64_t TEMP1_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE_TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMP0_0:1;
      uint64_t TEMP0_2:1;
      uint64_t reservedSpace0:1;
      uint64_t TEMP1_0:1;
      uint64_t TEMP1_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_TD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TS0_EN:1;
      uint64_t reservedSpace1:7;
      uint64_t TS1_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL_TD;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSNS_FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TS_FIR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VD_ST_CTRL:6;
      uint64_t ST_MODE:2;
      uint64_t reservedSpace0:8;
      uint64_t ST_DONE:1;
      uint64_t ST_RESULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELF_TEST_UM_VD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVD_FAULT:1;
      uint64_t HVD_FAULT:1;
      uint64_t reservedSpace0:1;
      uint64_t STEST_FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVD_CORE_COLD:1;
      uint64_t LVD_CORE_HOT:1;
      uint64_t HVD_CORE:1;
      uint64_t HVD_HV:1;
      uint64_t LVD_FLASH:1;
      uint64_t HVD_FLASH:1;
      uint64_t LVD_IO:1;
      uint64_t reservedSpace0:3;
      uint64_t LVD_SAR_ADC:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD_PMC:1;
      uint64_t reservedSpace2:16;
      uint64_t PMC_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVD_HVD_INTR_ENB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVD_CORE_COLD:1;
      uint64_t LVD_CORE_HOT:1;
      uint64_t HVD_CORE:1;
      uint64_t HVD_HV:1;
      uint64_t LVD_FLASH:1;
      uint64_t HVD_FLASH:1;
      uint64_t LVD_IO:1;
      uint64_t reservedSpace0:3;
      uint64_t LVD_SAR_ADC:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD_PMC:1;
      uint64_t reservedSpace2:1;
      uint64_t LVD_BUDDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVD_HVD_EVENT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVD_CORE_COLD:1;
      uint64_t LVD_CORE_HOT:1;
      uint64_t HVD_CORE:1;
      uint64_t HVD_HV:1;
      uint64_t LVD_FLASH:1;
      uint64_t HVD_FLASH:1;
      uint64_t LVD_IO:1;
      uint64_t reservedSpace0:3;
      uint64_t LVD_SAR_ADC:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD_PMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVD_CORE_COLD:1;
      uint64_t LVD_CORE_HOT:1;
      uint64_t HVD_CORE:1;
      uint64_t HVD_HV:1;
      uint64_t LVD_FLASH:1;
      uint64_t HVD_FLASH:1;
      uint64_t LVD_IO:1;
      uint64_t reservedSpace0:3;
      uint64_t LVD_SAR_ADC:1;
      uint64_t reservedSpace1:3;
      uint64_t LVD_PMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CHSE:6;
      uint64_t reservedSpace0:2;
      uint64_t STND_BY_RAM_BR_DETCT:1;
      uint64_t STND_BY_RAM_BO_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_CS;

