iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define SDADC_SDADC_8 (*(volatile struct SDADC_SDADC_8_tag *) 0xfff1c000)

struct SDADC_SDADC_9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MODE:1;
      uint64_t GECEN:1;
      uint64_t WRMODE:1;
      uint64_t VCOMSEL:1;
      uint64_t reservedSpace0:2;
      uint64_t FRZ:1;
      uint64_t TRIGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t TRIGEN:1;
      uint64_t TRIGEDSEL:2;
      uint64_t WDGEN:1;
      uint64_t HPFEN:1;
      uint64_t reservedSpace2:3;
      uint64_t PGAN:3;
      uint64_t reservedSpace3:1;
      uint64_t PDR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANCHSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t ANCHSEL_WRAP:3;
      uint64_t reservedSpace1:5;
      uint64_t BIASEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFF:1;
      uint64_t DFORF:1;
      uint64_t CDVF:1;
      uint64_t WTHL:1;
      uint64_t WTHH:1;
      uint64_t reservedSpace0:3;
      uint64_t DFEF:1;
      uint64_t reservedSpace1:7;
      uint64_t ANCHSEL_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFFDIRE:1;
      uint64_t DFORIE:1;
      uint64_t CDVEE:1;
      uint64_t WTHDIRE:1;
      uint64_t reservedSpace0:11;
      uint64_t GDIGE:1;
      uint64_t DFFDIRS:1;
      uint64_t WTHDIRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FE:1;
      uint64_t FSIZE:2;
      uint64_t reservedSpace0:5;
      uint64_t FTHLD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST_KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:16;
      uint64_t THRH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTHHLR;

};

#define SDADC_SDADC_9 (*(volatile struct SDADC_SDADC_9_tag *) 0xfbf1c000)

struct SIPI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t WRT:1;
      uint64_t RRT:1;
      uint64_t IDT:1;
      uint64_t ST:1;
      uint64_t CHEN:1;
      uint64_t WL:2;
      uint64_t reservedSpace0:8;
      uint64_t TC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CB:1;
      uint64_t ACKR:1;
      uint64_t TID:3;
      uint64_t RAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKIE:1;
      uint64_t TIDIE:1;
      uint64_t TOIE:1;
      uint64_t TCIE:1;
      uint64_t RAIE:1;
      uint64_t WAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTOR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCT:16;
      uint64_t CRCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t WRT:1;
      uint64_t RRT:1;
      uint64_t IDT:1;
      uint64_t ST:1;
      uint64_t CHEN:1;
      uint64_t WL:2;
      uint64_t reservedSpace0:8;
      uint64_t TC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CB:1;
      uint64_t ACKR:1;
      uint64_t TID:3;
      uint64_t RAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKIE:1;
      uint64_t TIDIE:1;
      uint64_t TOIE:1;
      uint64_t TCIE:1;
      uint64_t RAIE:1;
      uint64_t WAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTOR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCT:16;
      uint64_t CRCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEN:1;
      uint64_t WRT:1;
      uint64_t RRT:1;
      uint64_t IDT:1;
      uint64_t ST:1;
      uint64_t CHEN:1;
      uint64_t WL:2;
      uint64_t reservedSpace0:8;
      uint64_t TC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CB:1;
      uint64_t ACKR:1;
      uint64_t TID:3;
      uint64_t RAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR2;

