iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR132;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR133;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR134;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR136;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR137;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR138;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR140;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR141;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR149;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR150;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR151;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR173;

