iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR202;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR203;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR204;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR205;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR206;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR207;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR208;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR209;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
      uint64_t reservedSpace0:8;
      uint64_t WPUE:1;
      uint64_t WPDE:1;
      uint64_t HYS:1;
      uint64_t IBE:1;
      uint64_t ILS:2;
      uint64_t APC:1;
      uint64_t SMC:1;
      uint64_t ODC:2;
      uint64_t reservedSpace1:2;
      uint64_t OERC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR231;

