iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR611;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR612;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR613;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR614;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR615;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR616;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR617;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR618;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR619;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR620;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR621;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR622;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR623;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR624;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR625;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR626;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR627;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR628;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR629;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR630;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR631;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR632;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR633;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR634;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR635;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR636;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR637;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR638;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR639;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR640;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR641;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR642;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR643;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR644;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR645;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR646;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR647;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR648;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR649;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR650;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR651;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR652;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR653;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR654;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR655;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR656;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR657;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR658;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR659;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR660;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR661;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR662;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR663;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR664;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR665;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR666;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR667;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR668;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR669;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR670;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR671;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR672;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR673;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR674;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR675;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR676;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR677;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR678;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR679;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR680;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR681;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR682;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR683;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR684;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR685;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR686;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR687;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR688;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR689;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR690;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR691;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR692;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR693;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR694;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR695;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR696;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR697;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR698;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR699;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR700;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR701;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR702;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR703;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR704;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR705;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR706;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR707;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR708;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR709;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR710;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR711;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR712;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR713;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR714;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR715;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR716;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR717;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR718;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR719;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR720;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR721;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR722;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR723;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR724;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR725;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR726;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR727;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR728;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR729;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR730;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR731;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR732;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR733;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR734;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR735;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR736;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR737;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR738;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR739;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR740;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR741;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR742;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR743;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR744;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR745;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR746;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR747;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR748;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR749;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR750;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR751;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR752;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR753;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR754;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR755;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR756;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR757;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR758;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR759;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR760;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR761;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR762;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR763;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR764;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR765;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR766;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR767;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR768;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR769;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR770;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR771;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR772;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR773;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR774;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR775;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR776;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR777;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR778;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR779;

