iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR780;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR781;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR782;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR783;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR784;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR785;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR786;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR787;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR788;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR789;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR790;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR791;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR792;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR793;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR794;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR795;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR796;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR797;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR798;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR799;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR800;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR801;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR802;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR803;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR804;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR805;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR806;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR807;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR808;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR809;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR810;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR811;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR812;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR813;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR814;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR815;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR816;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR817;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR818;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR819;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR820;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR821;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR822;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR823;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR824;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR825;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR826;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR827;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR828;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR829;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR830;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR831;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR832;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR833;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR834;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR835;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR836;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR837;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR838;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR839;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR840;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR841;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR842;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR843;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR844;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR845;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR846;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR847;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR848;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR849;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR850;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR851;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR852;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR853;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR854;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR855;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR856;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR857;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR858;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR859;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR860;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR861;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR862;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR863;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR864;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR865;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR866;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR867;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR868;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR869;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR870;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR871;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR872;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR873;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR874;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR875;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR876;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR877;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR878;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR879;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR880;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR881;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR882;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR883;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR884;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR885;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR886;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR887;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR888;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR889;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR890;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR891;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR892;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR893;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR894;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR895;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR896;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR897;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR898;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR899;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR900;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR901;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR902;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR903;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR904;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR905;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR906;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR907;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR908;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR909;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR910;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR911;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR912;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR913;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR914;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR915;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR916;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR917;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR918;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR919;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR920;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR921;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR922;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR923;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR924;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR925;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR926;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR927;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR928;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR929;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR930;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR931;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR932;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR933;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR934;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR935;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR936;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR937;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR938;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR939;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR940;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR941;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR942;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR943;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR944;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR945;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR946;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR947;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR948;

