iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR949;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR950;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR951;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR952;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR953;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR954;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR955;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR956;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR957;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR958;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR959;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR960;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR961;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR962;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR963;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR964;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR965;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR966;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR967;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR968;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR969;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR970;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR971;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR972;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR973;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR974;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR975;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR976;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR977;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR978;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR979;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR980;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR981;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR982;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR983;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR984;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR985;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR986;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR987;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR988;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR989;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR990;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR991;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR992;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR993;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR994;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCR995;

  uint8_t res10[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPI224_SEL0:1;
      uint64_t GPI224_SEL1:1;
      uint64_t GPI224_STR0:1;
      uint64_t GPI224_STR1:1;
      uint64_t GPI225_SEL0:1;
      uint64_t GPI225_SEL1:1;
      uint64_t GPI225_STR0:1;
      uint64_t GPI225_STR1:1;
      uint64_t GPI226_SEL0:1;
      uint64_t GPI226_SEL1:1;
      uint64_t GPI226_STR0:1;
      uint64_t GPI226_STR1:1;
      uint64_t GPI227_SEL0:1;
      uint64_t GPI227_SEL1:1;
      uint64_t GPI227_STR0:1;
      uint64_t GPI227_STR1:1;
      uint64_t GPI240_SEL0:1;
      uint64_t GPI240_SEL1:1;
      uint64_t GPI240_STR0:1;
      uint64_t GPI240_STR1:1;
      uint64_t GPI241_SEL0:1;
      uint64_t GPI241_SEL1:1;
      uint64_t GPI241_STR0:1;
      uint64_t GPI241_STR1:1;
      uint64_t GPI242_SEL0:1;
      uint64_t GPI242_SEL1:1;
      uint64_t GPI242_STR0:1;
      uint64_t GPI242_STR1:1;
      uint64_t GPI243_SEL0:1;
      uint64_t GPI243_SEL1:1;
      uint64_t GPI243_STR0:1;
      uint64_t GPI243_STR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPI244_SEL0:1;
      uint64_t GPI244_SEL1:1;
      uint64_t GPI244_STR0:1;
      uint64_t GPI244_STR1:1;
      uint64_t GPI245_SEL0:1;
      uint64_t GPI245_SEL1:1;
      uint64_t GPI245_STR0:1;
      uint64_t GPI245_STR1:1;
      uint64_t GPI246_SEL0:1;
      uint64_t GPI246_SEL1:1;
      uint64_t GPI246_STR0:1;
      uint64_t GPI246_STR1:1;
      uint64_t GPI247_SEL0:1;
      uint64_t GPI247_SEL1:1;
      uint64_t GPI247_STR0:1;
      uint64_t GPI247_STR1:1;
      uint64_t GPI248_SEL0:1;
      uint64_t GPI248_SEL1:1;
      uint64_t GPI248_STR0:1;
      uint64_t GPI248_STR1:1;
      uint64_t GPI249_SEL0:1;
      uint64_t GPI249_SEL1:1;
      uint64_t GPI249_STR0:1;
      uint64_t GPI249_STR1:1;
      uint64_t GPI250_SEL0:1;
      uint64_t GPI250_SEL1:1;
      uint64_t GPI250_STR0:1;
      uint64_t GPI250_STR1:1;
      uint64_t GPI251_SEL0:1;
      uint64_t GPI251_SEL1:1;
      uint64_t GPI251_STR0:1;
      uint64_t GPI251_STR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPI252_SEL0:1;
      uint64_t GPI252_SEL1:1;
      uint64_t GPI252_STR0:1;
      uint64_t GPI252_STR1:1;
      uint64_t GPI253_SEL0:1;
      uint64_t GPI253_SEL1:1;
      uint64_t GPI253_STR0:1;
      uint64_t GPI253_STR1:1;
      uint64_t GPI254_SEL0:1;
      uint64_t GPI254_SEL1:1;
      uint64_t GPI254_STR0:1;
      uint64_t GPI254_STR1:1;
      uint64_t GPI255_SEL0:1;
      uint64_t GPI255_SEL1:1;
      uint64_t GPI255_STR0:1;
      uint64_t GPI255_STR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPR2;

  uint8_t res11[180];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO102;

