iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define SIUL2_1 (*(volatile struct SIUL2_1_tag *) 0xfffc0004)

struct SMPU_SMPU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GVLD:1;
      uint64_t HRL:3;
      uint64_t reservedSpace0:12;
      uint64_t MERR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CESR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NRGD:4;
      uint64_t reservedSpace0:12;
      uint64_t MEOVR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CESR1;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMN:4;
      uint64_t ERW:1;
      uint64_t EATTR:2;
      uint64_t reservedSpace0:1;
      uint64_t EACD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDR15;

  uint8_t res1[640];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD010;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD210;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD310;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRTADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD011;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15P:2;
      uint64_t M14P:2;
      uint64_t M13P:2;
      uint64_t M12P:2;
      uint64_t M11P:2;
      uint64_t M10P:2;
      uint64_t M9P:2;
      uint64_t M8P:2;
      uint64_t M7P:2;
      uint64_t M6P:2;
      uint64_t M5P:2;
      uint64_t M4P:2;
      uint64_t M3P:2;
      uint64_t M2P:2;
      uint64_t M1P:2;
      uint64_t M0P:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t CI:1;
      uint64_t reservedSpace0:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD_WORD311;

