iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSC:14;
      uint64_t reservedSpace0:1;
      uint64_t COMP_EN:1;
      uint64_t CM_PRSC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CLK_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NUM_EDGES_ERR:1;
      uint64_t FMSG_CRC_ERR:1;
      uint64_t SMSG_CRC_ERR:1;
      uint64_t NIB_VAL_ERR:1;
      uint64_t CAL_DIAG_ERR:1;
      uint64_t CAL_LEN_ERR:1;
      uint64_t PP_DIAG_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t FMSG_OFLW:1;
      uint64_t SMSG_OFLW:1;
      uint64_t CAL_20_25:1;
      uint64_t CAL_RESYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t BUS_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_STATUS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIL_CNT:8;
      uint64_t SUCC_CAL_CHK:1;
      uint64_t PAUSE_EN:1;
      uint64_t SCRC_TYPE:1;
      uint64_t FCRC_SC_EN:1;
      uint64_t FCRC_TYPE:1;
      uint64_t PP_CHKSEL:1;
      uint64_t CAL_RNG:1;
      uint64_t DCHNG_INT:1;
      uint64_t IE_NUM_EDGES_ERR:1;
      uint64_t IE_FMSG_CRC_ERR:1;
      uint64_t IE_SMSG_CRC_ERR:1;
      uint64_t IE_NIB_VAL_ERR:1;
      uint64_t IE_CAL_DIAG_ERR:1;
      uint64_t IE_CAL_LEN_ERR:1;
      uint64_t IE_PP_DIAG_ERR:1;
      uint64_t FCRC_CHK_OFF:1;
      uint64_t IE_FMSG_OFLW:1;
      uint64_t IE_SMSG_OFLW:1;
      uint64_t IE_CAL_20_25:1;
      uint64_t IE_CAL_RESYNC:1;
      uint64_t BUS_IDLE_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CONFIG2;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSC:14;
      uint64_t reservedSpace0:1;
      uint64_t COMP_EN:1;
      uint64_t CM_PRSC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CLK_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NUM_EDGES_ERR:1;
      uint64_t FMSG_CRC_ERR:1;
      uint64_t SMSG_CRC_ERR:1;
      uint64_t NIB_VAL_ERR:1;
      uint64_t CAL_DIAG_ERR:1;
      uint64_t CAL_LEN_ERR:1;
      uint64_t PP_DIAG_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t FMSG_OFLW:1;
      uint64_t SMSG_OFLW:1;
      uint64_t CAL_20_25:1;
      uint64_t CAL_RESYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t BUS_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_STATUS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIL_CNT:8;
      uint64_t SUCC_CAL_CHK:1;
      uint64_t PAUSE_EN:1;
      uint64_t SCRC_TYPE:1;
      uint64_t FCRC_SC_EN:1;
      uint64_t FCRC_TYPE:1;
      uint64_t PP_CHKSEL:1;
      uint64_t CAL_RNG:1;
      uint64_t DCHNG_INT:1;
      uint64_t IE_NUM_EDGES_ERR:1;
      uint64_t IE_FMSG_CRC_ERR:1;
      uint64_t IE_SMSG_CRC_ERR:1;
      uint64_t IE_NIB_VAL_ERR:1;
      uint64_t IE_CAL_DIAG_ERR:1;
      uint64_t IE_CAL_LEN_ERR:1;
      uint64_t IE_PP_DIAG_ERR:1;
      uint64_t FCRC_CHK_OFF:1;
      uint64_t IE_FMSG_OFLW:1;
      uint64_t IE_SMSG_OFLW:1;
      uint64_t IE_CAL_20_25:1;
      uint64_t IE_CAL_RESYNC:1;
      uint64_t BUS_IDLE_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CONFIG3;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSC:14;
      uint64_t reservedSpace0:1;
      uint64_t COMP_EN:1;
      uint64_t CM_PRSC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CLK_CTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NUM_EDGES_ERR:1;
      uint64_t FMSG_CRC_ERR:1;
      uint64_t SMSG_CRC_ERR:1;
      uint64_t NIB_VAL_ERR:1;
      uint64_t CAL_DIAG_ERR:1;
      uint64_t CAL_LEN_ERR:1;
      uint64_t PP_DIAG_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t FMSG_OFLW:1;
      uint64_t SMSG_OFLW:1;
      uint64_t CAL_20_25:1;
      uint64_t CAL_RESYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t BUS_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_STATUS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIL_CNT:8;
      uint64_t SUCC_CAL_CHK:1;
      uint64_t PAUSE_EN:1;
      uint64_t SCRC_TYPE:1;
      uint64_t FCRC_SC_EN:1;
      uint64_t FCRC_TYPE:1;
      uint64_t PP_CHKSEL:1;
      uint64_t CAL_RNG:1;
      uint64_t DCHNG_INT:1;
      uint64_t IE_NUM_EDGES_ERR:1;
      uint64_t IE_FMSG_CRC_ERR:1;
      uint64_t IE_SMSG_CRC_ERR:1;
      uint64_t IE_NIB_VAL_ERR:1;
      uint64_t IE_CAL_DIAG_ERR:1;
      uint64_t IE_CAL_LEN_ERR:1;
      uint64_t IE_PP_DIAG_ERR:1;
      uint64_t FCRC_CHK_OFF:1;
      uint64_t IE_FMSG_OFLW:1;
      uint64_t IE_SMSG_OFLW:1;
      uint64_t IE_CAL_20_25:1;
      uint64_t IE_CAL_RESYNC:1;
      uint64_t BUS_IDLE_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CONFIG4;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSC:14;
      uint64_t reservedSpace0:1;
      uint64_t COMP_EN:1;
      uint64_t CM_PRSC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CLK_CTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NUM_EDGES_ERR:1;
      uint64_t FMSG_CRC_ERR:1;
      uint64_t SMSG_CRC_ERR:1;
      uint64_t NIB_VAL_ERR:1;
      uint64_t CAL_DIAG_ERR:1;
      uint64_t CAL_LEN_ERR:1;
      uint64_t PP_DIAG_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t FMSG_OFLW:1;
      uint64_t SMSG_OFLW:1;
      uint64_t CAL_20_25:1;
      uint64_t CAL_RESYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t BUS_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_STATUS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIL_CNT:8;
      uint64_t SUCC_CAL_CHK:1;
      uint64_t PAUSE_EN:1;
      uint64_t SCRC_TYPE:1;
      uint64_t FCRC_SC_EN:1;
      uint64_t FCRC_TYPE:1;
      uint64_t PP_CHKSEL:1;
      uint64_t CAL_RNG:1;
      uint64_t DCHNG_INT:1;
      uint64_t IE_NUM_EDGES_ERR:1;
      uint64_t IE_FMSG_CRC_ERR:1;
      uint64_t IE_SMSG_CRC_ERR:1;
      uint64_t IE_NIB_VAL_ERR:1;
      uint64_t IE_CAL_DIAG_ERR:1;
      uint64_t IE_CAL_LEN_ERR:1;
      uint64_t IE_PP_DIAG_ERR:1;
      uint64_t FCRC_CHK_OFF:1;
      uint64_t IE_FMSG_OFLW:1;
      uint64_t IE_SMSG_OFLW:1;
      uint64_t IE_CAL_20_25:1;
      uint64_t IE_CAL_RESYNC:1;
      uint64_t BUS_IDLE_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CONFIG5;

  uint8_t res11[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_CRC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_TS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_TS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_DATA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_CRC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_TS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_TS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_DATA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_CRC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_TS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_TS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_DATA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_CRC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_TS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_TS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_DATA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_CRC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_TS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_TS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_DATA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_CRC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_FMSG_TS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_BIT25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_SMSG_TS5;

