iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
};

#define SRX_SRX_0 (*(volatile struct SRX_SRX_0_tag *) 0xffe5c000)

struct SRX_SRX_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SENT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t DBG_FRZ:1;
      uint64_t reservedSpace1:1;
      uint64_t FAST_CLR:1;
      uint64_t reservedSpace2:3;
      uint64_t SMDUIE:1;
      uint64_t FMDUIE:1;
      uint64_t reservedSpace3:5;
      uint64_t NIB_LEN_VAR_LIMIT:1;
      uint64_t reservedSpace4:8;
      uint64_t TSPRSC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GBL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN_CH:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHNL_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SMDU:1;
      uint64_t FMDU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GBL_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_RDY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSG_RDY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_RDY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMSG_RDY;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t NIBBCH5:3;
      uint64_t reservedSpace1:1;
      uint64_t NIBBCH4:3;
      uint64_t reservedSpace2:1;
      uint64_t NIBBCH3:3;
      uint64_t reservedSpace3:1;
      uint64_t NIBBCH2:3;
      uint64_t reservedSpace4:1;
      uint64_t NIBBCH1:3;
      uint64_t reservedSpace5:1;
      uint64_t NIBBCH0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_CTRL1;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDMA_EN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDMA_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDMA_EN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMA_CTRL;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDY_IE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRDY_IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRDY_IE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRDY_IE;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNIB6:4;
      uint64_t DNIB5:4;
      uint64_t DNIB4:4;
      uint64_t DNIB3:4;
      uint64_t DNIB2:4;
      uint64_t DNIB1:4;
      uint64_t SCNIB:4;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_FMSG_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CRC4b:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_FMSG_CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_FMSG_TS;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ID3_0_DATA15_12:4;
      uint64_t reservedSpace1:1;
      uint64_t ID7_4_ID3_0:4;
      uint64_t CFG:1;
      uint64_t reservedSpace2:16;
      uint64_t TYPE:1;
      uint64_t CHNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_SMSG_BIT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_110:12;
      uint64_t reservedSpace0:4;
      uint64_t SMCRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_SMSG_BIT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_SMSG_TS;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSC:14;
      uint64_t reservedSpace0:1;
      uint64_t COMP_EN:1;
      uint64_t CM_PRSC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CLK_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NUM_EDGES_ERR:1;
      uint64_t FMSG_CRC_ERR:1;
      uint64_t SMSG_CRC_ERR:1;
      uint64_t NIB_VAL_ERR:1;
      uint64_t CAL_DIAG_ERR:1;
      uint64_t CAL_LEN_ERR:1;
      uint64_t PP_DIAG_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t FMSG_OFLW:1;
      uint64_t SMSG_OFLW:1;
      uint64_t CAL_20_25:1;
      uint64_t CAL_RESYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t BUS_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_STATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIL_CNT:8;
      uint64_t SUCC_CAL_CHK:1;
      uint64_t PAUSE_EN:1;
      uint64_t SCRC_TYPE:1;
      uint64_t FCRC_SC_EN:1;
      uint64_t FCRC_TYPE:1;
      uint64_t PP_CHKSEL:1;
      uint64_t CAL_RNG:1;
      uint64_t DCHNG_INT:1;
      uint64_t IE_NUM_EDGES_ERR:1;
      uint64_t IE_FMSG_CRC_ERR:1;
      uint64_t IE_SMSG_CRC_ERR:1;
      uint64_t IE_NIB_VAL_ERR:1;
      uint64_t IE_CAL_DIAG_ERR:1;
      uint64_t IE_CAL_LEN_ERR:1;
      uint64_t IE_PP_DIAG_ERR:1;
      uint64_t FCRC_CHK_OFF:1;
      uint64_t IE_FMSG_OFLW:1;
      uint64_t IE_SMSG_OFLW:1;
      uint64_t IE_CAL_20_25:1;
      uint64_t IE_CAL_RESYNC:1;
      uint64_t BUS_IDLE_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CONFIG0;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRSC:14;
      uint64_t reservedSpace0:1;
      uint64_t COMP_EN:1;
      uint64_t CM_PRSC:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CLK_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t NUM_EDGES_ERR:1;
      uint64_t FMSG_CRC_ERR:1;
      uint64_t SMSG_CRC_ERR:1;
      uint64_t NIB_VAL_ERR:1;
      uint64_t CAL_DIAG_ERR:1;
      uint64_t CAL_LEN_ERR:1;
      uint64_t PP_DIAG_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t FMSG_OFLW:1;
      uint64_t SMSG_OFLW:1;
      uint64_t CAL_20_25:1;
      uint64_t CAL_RESYNC:1;
      uint64_t reservedSpace2:3;
      uint64_t BUS_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_STATUS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIL_CNT:8;
      uint64_t SUCC_CAL_CHK:1;
      uint64_t PAUSE_EN:1;
      uint64_t SCRC_TYPE:1;
      uint64_t FCRC_SC_EN:1;
      uint64_t FCRC_TYPE:1;
      uint64_t PP_CHKSEL:1;
      uint64_t CAL_RNG:1;
      uint64_t DCHNG_INT:1;
      uint64_t IE_NUM_EDGES_ERR:1;
      uint64_t IE_FMSG_CRC_ERR:1;
      uint64_t IE_SMSG_CRC_ERR:1;
      uint64_t IE_NIB_VAL_ERR:1;
      uint64_t IE_CAL_DIAG_ERR:1;
      uint64_t IE_CAL_LEN_ERR:1;
      uint64_t IE_PP_DIAG_ERR:1;
      uint64_t FCRC_CHK_OFF:1;
      uint64_t IE_FMSG_OFLW:1;
      uint64_t IE_SMSG_OFLW:1;
      uint64_t IE_CAL_20_25:1;
      uint64_t IE_CAL_RESYNC:1;
      uint64_t BUS_IDLE_CNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CONFIG1;

