iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBE0:1;
      uint64_t MBE1:1;
      uint64_t MBE2:1;
      uint64_t MBE3:1;
      uint64_t MBE4:1;
      uint64_t MBE5:1;
      uint64_t MBE6:1;
      uint64_t MBE7:1;
      uint64_t MBE8:1;
      uint64_t MBE9:1;
      uint64_t MBE10:1;
      uint64_t MBE11:1;
      uint64_t MBE12:1;
      uint64_t MBE13:1;
      uint64_t MBE14:1;
      uint64_t MBE15:1;
      uint64_t MBE16:1;
      uint64_t MBE17:1;
      uint64_t MBE18:1;
      uint64_t MBE19:1;
      uint64_t MBE20:1;
      uint64_t MBE21:1;
      uint64_t MBE22:1;
      uint64_t MBE23:1;
      uint64_t MBE24:1;
      uint64_t MBE25:1;
      uint64_t MBE26:1;
      uint64_t MBE27:1;
      uint64_t MBE28:1;
      uint64_t MBE29:1;
      uint64_t MBE30:1;
      uint64_t MBE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBE32:1;
      uint64_t MBE33:1;
      uint64_t MBE34:1;
      uint64_t MBE35:1;
      uint64_t MBE36:1;
      uint64_t MBE37:1;
      uint64_t MBE38:1;
      uint64_t MBE39:1;
      uint64_t MBE40:1;
      uint64_t MBE41:1;
      uint64_t MBE42:1;
      uint64_t MBE43:1;
      uint64_t MBE44:1;
      uint64_t MBE45:1;
      uint64_t MBE46:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBEM;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBSSW0:1;
      uint64_t MBSSW1:1;
      uint64_t MBSSW2:1;
      uint64_t MBSSW3:1;
      uint64_t MBSSW4:1;
      uint64_t MBSSW5:1;
      uint64_t MBSSW6:1;
      uint64_t MBSSW7:1;
      uint64_t MBSSW8:1;
      uint64_t MBSSW9:1;
      uint64_t MBSSW10:1;
      uint64_t MBSSW11:1;
      uint64_t MBSSW12:1;
      uint64_t MBSSW13:1;
      uint64_t MBSSW14:1;
      uint64_t MBSSW15:1;
      uint64_t MBSSW16:1;
      uint64_t MBSSW17:1;
      uint64_t MBSSW18:1;
      uint64_t MBSSW19:1;
      uint64_t MBSSW20:1;
      uint64_t MBSSW21:1;
      uint64_t MBSSW22:1;
      uint64_t MBSSW23:1;
      uint64_t MBSSW24:1;
      uint64_t MBSSW25:1;
      uint64_t MBSSW26:1;
      uint64_t MBSSW27:1;
      uint64_t MBSSW28:1;
      uint64_t MBSSW29:1;
      uint64_t MBSSW30:1;
      uint64_t MBSSW31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBSLSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBSSW32:1;
      uint64_t MBSSW33:1;
      uint64_t MBSSW34:1;
      uint64_t MBSSW35:1;
      uint64_t MBSSW36:1;
      uint64_t MBSSW37:1;
      uint64_t MBSSW38:1;
      uint64_t MBSSW39:1;
      uint64_t MBSSW40:1;
      uint64_t MBSSW41:1;
      uint64_t MBSSW42:1;
      uint64_t MBSSW43:1;
      uint64_t MBSSW44:1;
      uint64_t MBSSW45:1;
      uint64_t MBSSW46:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBSMSW;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBESW0:1;
      uint64_t MBESW1:1;
      uint64_t MBESW2:1;
      uint64_t MBESW3:1;
      uint64_t MBESW4:1;
      uint64_t MBESW5:1;
      uint64_t MBESW6:1;
      uint64_t MBESW7:1;
      uint64_t MBESW8:1;
      uint64_t MBESW9:1;
      uint64_t MBESW10:1;
      uint64_t MBESW11:1;
      uint64_t MBESW12:1;
      uint64_t MBESW13:1;
      uint64_t MBESW14:1;
      uint64_t MBESW15:1;
      uint64_t MBESW16:1;
      uint64_t MBESW17:1;
      uint64_t MBESW18:1;
      uint64_t MBESW19:1;
      uint64_t MBESW20:1;
      uint64_t MBESW21:1;
      uint64_t MBESW22:1;
      uint64_t MBESW23:1;
      uint64_t MBESW24:1;
      uint64_t MBESW25:1;
      uint64_t MBESW26:1;
      uint64_t MBESW27:1;
      uint64_t MBESW28:1;
      uint64_t MBESW29:1;
      uint64_t MBESW30:1;
      uint64_t MBESW31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBELSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBESW32:1;
      uint64_t MBESW33:1;
      uint64_t MBESW34:1;
      uint64_t MBESW35:1;
      uint64_t MBESW36:1;
      uint64_t MBESW37:1;
      uint64_t MBESW38:1;
      uint64_t MBESW39:1;
      uint64_t MBESW40:1;
      uint64_t MBESW41:1;
      uint64_t MBESW42:1;
      uint64_t MBESW43:1;
      uint64_t MBESW44:1;
      uint64_t MBESW45:1;
      uint64_t MBESW46:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBEMSW;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBUFM0:1;
      uint64_t MBUFM1:1;
      uint64_t MBUFM2:1;
      uint64_t MBUFM3:1;
      uint64_t MBUFM4:1;
      uint64_t MBUFM5:1;
      uint64_t MBUFM6:1;
      uint64_t MBUFM7:1;
      uint64_t MBUFM8:1;
      uint64_t MBUFM9:1;
      uint64_t MBUFM10:1;
      uint64_t MBUFM11:1;
      uint64_t MBUFM12:1;
      uint64_t MBUFM13:1;
      uint64_t MBUFM14:1;
      uint64_t MBUFM15:1;
      uint64_t MBUFM16:1;
      uint64_t MBUFM17:1;
      uint64_t MBUFM18:1;
      uint64_t MBUFM19:1;
      uint64_t MBUFM20:1;
      uint64_t MBUFM21:1;
      uint64_t MBUFM22:1;
      uint64_t MBUFM23:1;
      uint64_t MBUFM24:1;
      uint64_t MBUFM25:1;
      uint64_t MBUFM26:1;
      uint64_t MBUFM27:1;
      uint64_t MBUFM28:1;
      uint64_t MBUFM29:1;
      uint64_t MBUFM30:1;
      uint64_t MBUFM31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBUFML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBUFM32:1;
      uint64_t MBUFM33:1;
      uint64_t MBUFM34:1;
      uint64_t MBUFM35:1;
      uint64_t MBUFM36:1;
      uint64_t MBUFM37:1;
      uint64_t MBUFM38:1;
      uint64_t MBUFM39:1;
      uint64_t MBUFM40:1;
      uint64_t MBUFM41:1;
      uint64_t MBUFM42:1;
      uint64_t MBUFM43:1;
      uint64_t MBUFM44:1;
      uint64_t MBUFM45:1;
      uint64_t MBUFM46:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBUFMM;

  uint8_t res5[132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWS:5;
      uint64_t reservedSpace0:1;
      uint64_t PFT:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN_ON:4;
      uint64_t SCEN_OFF:4;
      uint64_t SHS:3;
      uint64_t reservedSpace2:5;
      uint64_t PTR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_PCS0;

