iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISREx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISREx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRELSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREHSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRLSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRHSW0;

  uint8_t res7[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWS:5;
      uint64_t reservedSpace0:1;
      uint64_t PFT:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN_ON:4;
      uint64_t SCEN_OFF:4;
      uint64_t SHS:3;
      uint64_t reservedSpace2:5;
      uint64_t PTR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_PCS1;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISREx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREL1;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRELSW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREHSW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRLSW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRHSW1;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWS:5;
      uint64_t reservedSpace0:1;
      uint64_t PFT:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN_ON:4;
      uint64_t SCEN_OFF:4;
      uint64_t SHS:3;
      uint64_t reservedSpace2:5;
      uint64_t PTR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_PCS2;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISREx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREL2;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRELSW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREHSW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRLSW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRHSW2;

  uint8_t res13[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWS:5;
      uint64_t reservedSpace0:1;
      uint64_t PFT:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN_ON:4;
      uint64_t SCEN_OFF:4;
      uint64_t SHS:3;
      uint64_t reservedSpace2:5;
      uint64_t PTR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_PCS3;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISREx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREL3;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRELSW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREHSW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRLSW3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRHSW3;

  uint8_t res16[1040];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PTR:7;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL46;

