iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC5746R_eTPU/mpc5746r_sfr.h
  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:21;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS6;

  uint8_t res13[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS7;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:21;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS7;

  uint8_t res15[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR0;

  uint8_t res16[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR1;

  uint8_t res17[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR2;

  uint8_t res18[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR3;

  uint8_t res19[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR4;

  uint8_t res20[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR5;

  uint8_t res21[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR6;

  uint8_t res22[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGPCR7;

};

#define XBAR_XBAR_1 (*(volatile struct XBAR_XBAR_1_tag *) 0xfc008000)

struct XOSC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t I_OSC:1;
      uint64_t reservedSpace1:7;
      uint64_t M_OSC:1;
      uint64_t EOCV:8;
      uint64_t reservedSpace2:7;
      uint64_t OSCBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define XOSC_1 (*(volatile struct XOSC_1_tag *) 0xfffb0080)

